YanqiS/stm32test/main - 副本.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/**
 * version .3.1
 * last change: add KL15 channel
 */

/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <math.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdbool.h>
//#include <Device_V1.h>
#include <OLED.h>
//#include <USBPD.h>

#include <stm32g0xx_hal_fdcan.h>

////mylib
#include <EasySyslib.h>
//#include "ModBus.h"
//#include "TCHUBv3.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
SPI_HandleTypeDef *Flash_SPI;

UART_HandleTypeDef *Serial_Num;

#define ADC_CHANNELS 	5
#define LightSensr_Gate 	50
uint16_t adc_buffer[ADC_CHANNELS] = { 0 };

int Version_A = 8;	//Ver  A.BC
int Version_B = 2;
int Version_C = 9;	//0.08

//#define Serial_Data_LENGTH		24	//24-1
uint16_t LIN_Data_LENGTH = 1;	//1;
uint16_t Serial_Data_LENGTH = 24;

uint16_t CAN1_2Ser_ID[32];
uint16_t CAN2_2Ser_ID[32];

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

FDCAN_HandleTypeDef hfdcan1;
FDCAN_HandleTypeDef hfdcan2;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim7;
TIM_HandleTypeDef htim14;
TIM_HandleTypeDef htim15;
TIM_HandleTypeDef htim16;
TIM_HandleTypeDef htim17;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */

//////// ////////system level
//sys time
uint8_t Enp_YEAR, Enp_MONTH, Enp_DAY, Enp_HOUR, Enp_MINUTE, Enp_SECOND;
uint8_t EncrypKey;

uint8_t dateTimeBuffer[7];

bool SW_UP, SW_UP_pre, SW_DW, SW_DW_pre, SW_LEFT, SW_LEFT_pre, SW_RIGHT,
		SW_RIGHT_pre, SW_BUTTON, SW_BUTTON_pre;
uint8_t SW_UP_cnt = 0;
uint8_t SW_DW_cnt = 0;
uint8_t SW_LEFT_cnt = 0;
uint8_t SW_RIGHT_cnt = 0;
//W25Q64 	sector		block		page
//8M/64m	 256	x	 64		x	 256
int Sys_CNT, Sys_RunCNT, Sys_CNT1, Sys_RunCNT1;
////	DispX0,DispX1,DispY0,DispY1;
uint32_t Sys_Addr_DispTest = 0x001000;
uint32_t Sys_Addr_DispX0 = 0x001100;
uint32_t Sys_Addr_DispX1 = 0x001110;
uint32_t Sys_Addr_DispY0 = 0x001200;		//
uint32_t Sys_Addr_DispY1 = 0x001210;		//

uint32_t Sys_TIM_TICK;	//1-1000ms
bool Sys_TIM_Flag;

//config
int8_t BoardID;
bool SW1_1, SW1_2, SW2_1, SW2_2;
int Mode_ID;//IO_CFG_1/2/3/4	电阻上拉，拨码开关off时高电平，on时与GND导�?�，低电�?????????????????????????????????????????????????????????????????????

//state
int sys_state = 0; //0 - 6; 	0 - none; 1- green	;2 - cyan(青色，天蓝）;3 - blue	;4 - yellow	;5 - purple	;6 - red
bool ERR = 0;
int Remote_state = 0;
uint8_t Web_ConnectSts;

////LIN
uint8_t DataReceiveflag;
uint8_t DataProcess;
uint8_t ReceivePID, ReceiveID;
uint8_t FrameReceiveOverFlag;
uint8_t LinReceiveData[9];
uint8_t ReceiveData, SendCheckSum, ReceiveCheckSum;
uint8_t DtRxProcess;

#define CANMsg_MNumb		32
FDCAN_TxHeaderTypeDef CAN_TxHeader[CANMsg_MNumb];
FDCAN_TxHeaderTypeDef FDCAN_TxHeader[CANMsg_MNumb];

//////// ////////app level

//Motor Control
struct MotorCtrl_TypeDef MotorCtrl_M1, MotorCtrl_M2, MotorCtrl_M3, MotorCtrl_M4;
uint16_t HostID = 0x01;
uint16_t M1_ID = 0x0D1; //D1	D2,	X
uint16_t M2_ID = 0x0D2; //D1	D2,	X
uint16_t M3_ID = 0x0D3; //D3	D4,	Y
uint16_t M4_ID = 0x0D5; //D5,	Z

uint8_t MotorInit_M1, MotorInit_M2, MotorInit_M3, MotorInit_M4;
bool MotorERR_M1, MotorERR_M2, MotorERR_M3, MotorERR_M4;

#define XmaxLimit 	600		//290
#define YmaxLimit 	600		//435

//#define RCtrl_Mode_0m1p		1

//#define DispX0 	100		////#define DispX1 	120		////#define DispY0 	100		////#define DispY1 	120		//
//uint8_t	DispX0[4],DispX1[4],DispY0[4],DispY1[4];
//int	DispX0_32b,DispX1_32b,DispY0_32b,DispY1_32b;

struct ScreenSize_TypeDef ScreenSz_1;

//web232
struct Ser2CAN_Msg_TypeDef Ser2CAN_Msg[CANMsg_MNumb];
struct SerLoCtrl_Msg_TypeDef SerLoCtrl_Msg;
struct Bench_AckInfo_TypeDef Bench_Info;

//TA531
struct TA531_env_TypeDef TA531SysEnv;
struct TA531_TimCallback_TypeDef TA531TimCallback;
struct TA531_RobotCtrl_TypeDef TA531_RC1;

struct TA531_GP_IN_TypeDef TA531_GP_IN;
uint8_t TSA_GP_IN_DATA[8];

uint8_t TA531_RC1_fg;// 0-Error;	1-no task;	2-command received;	3-command accomplish;
uint8_t TA531_RC1_x_ready, TA531_RC1_y_ready, TA531_RC1_z_ready;
uint8_t TA531_RC1_Ack, TA531_Lock;

//stm32 header

FDCAN_TxHeaderTypeDef CAN_TxHeader[CANMsg_MNumb];
FDCAN_TxHeaderTypeDef FDCAN_TxHeader[CANMsg_MNumb];

FDCAN_TxHeaderTypeDef MotrCtrl_1_TxHeader, MotrCtrl_2_TxHeader,
		MotrCtrl_3_TxHeader, MotrCtrl_4_TxHeader;
FDCAN_RxHeaderTypeDef FDCAN1_RxHeader, FDCAN2_RxHeader, MotrCtrl_1_RxHeader,
		MotrCtrl_2_RxHeader, MotrCtrl_3_RxHeader;
FDCAN_FilterTypeDef FDCAN_Filter1[28], FDCAN_Filter2[28]; //
FDCAN_TxHeaderTypeDef TSA_Ack_Header, TSA1_ADC_Header, TSA2_LS_Header,
		TSA_Ack_RC_Header, TSA_GP_IN_Header;

//ccommunication

uint8_t CH1RxData[8], CH2RxData[8];
uint8_t CH1TxData[8], CH2TxData[8], TSA1_ADC_DATA[8], TSA2_LS_DATA[8],
		TSA_Ack_DATA[8], TSA_Ack_RC_DATA[8];
uint8_t SWS_0x00_Data[9], SWS_0x02_Data[9], HOD_0x0_Data[9], EBS_0x0_Data[9],
		IFP_0x0_Data[9];
bool SWS_0x00_Flag, SWS_0x02_Flag, HOD_0x0_Flag, EBS_0x0_Flag, IFP_0x0_Flag;
uint8_t MotrCtrl_1_DATA[8], MotrCtrl_2_DATA[8], MotrCtrl_3_DATA[8],
		MotrCtrl_4_DATA[8];

