YanqiS/stm32test/main - 副本.c
uint8_t I2CRxData[REC_LENGTH];
uint8_t u1RxData[REC_LENGTH], u2RxData[REC_LENGTH], u3RxData[REC_LENGTH],
		u4RxData[REC_LENGTH], u5RxData[REC_LENGTH], u6RxData[REC_LENGTH],
		RxData[REC_LENGTH];
uint8_t Serial_TxData[REC_LENGTH] = { 0 };
uint8_t Bench_Info_TxData[REC_LENGTH] = { 0 };

struct TA531_LIN_GW_TypeDef TA531_LIN_GW;
struct TA531_LIN_SWS_TypeDef TA531_LIN_SWS;

uint32_t len;

bool rxflag;
bool U1RXFlag = 0, U2RXFlag = 0, U3RXFlag = 0, U4RXFlag = 0, U5RXFlag = 0,
		U6RXFlag = 0;

bool TSA3_0x52_Flag = 0, TSA4_0x53_Flag = 0, TSA4_0x103_Flag = 0;

uint32_t adc_value;
uint32_t mVoltage;

// 电机保护结构体定义
struct Motor_Protection_TypeDef {
    int16_t last_X_pos;              // 上次X位置
    int16_t last_Y_pos;              // 上次Y位置
    int8_t X_direction_changes;      // X方向变化计数
    int8_t Y_direction_changes;      // Y方向变化计数
    uint16_t stuck_counter;          // 停滞计数器
    uint16_t movement_timeout;       // 运动超时计数
    uint8_t protection_triggered;    // 保护触发状态
    uint8_t error_type;              // 错误类型
    uint32_t total_errors;           // 总错误计数
};

// 全局变量实例化
struct Motor_Protection_TypeDef Motor_Protection;

// 保护参数宏定义
#define MOTOR_PROTECTION_ENABLED        1       // 启用保护
#define MAX_DIRECTION_CHANGES          3       // 最大方向变化次数
#define MAX_STUCK_COUNT               3      // 最大停滞次数
#define MAX_MOVEMENT_TIMEOUT         100       // 最大运动超时
#define POSITION_TOLERANCE             5       // 位置容差


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_CRC_Init(void);
static void MX_I2C3_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM7_Init(void);
static void MX_TIM14_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM16_Init(void);
static void MX_TIM17_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM15_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */
void UART_RESET(UART_HandleTypeDef *huart);
void UART_Init(UART_HandleTypeDef *huart, uint32_t data_length);
void LIN_RESET(UART_HandleTypeDef *huart);
uint8_t Lin_CheckPID(uint8_t id);
uint8_t Lin_Checksum(uint8_t id, uint8_t data[]);
void Lin_SendData(uint8_t *data);
void Lin_DataProcess_loop(void);

void Ser2CAN(void);
uint32_t mRead_ADC1_ch(uint8_t ch);
void Sys_tune1();
void Sys_tune2();
void MoC_Init();
void MotoCtrl_PackSend12();
//void MotoCtrl_PackSend2();
void MotoCtrl_PackSend3();
void MotoCtrl_PackSend4();
void MotoCtrl_PositionLoop(int PositionX_mm, int PositionY_mm);
//void CAN2Ser_Config(void);
void Set_SystemReboot();

void Clamp_Position(int *x, int *y, bool allow_reset);

void SPI_Flash_Start(SPI_HandleTypeDef *hspi);
void SPI_Stop(SPI_HandleTypeDef *hspi);

uint8_t ByteEncryp(uint8_t byteData);


void Motor_Protection_Init(void);
void Motor_Protection_Reset(void);
uint8_t Motor_Protection_Check(int16_t current_X, int16_t current_Y,
                                int16_t target_X, int16_t target_Y);
void Motor_Protection_EmergencyStop(void);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

//
//  CAN2Ser_ID[3]=0xdf;
//  CAN2Ser_ID[5]=0x2;
//  CAN2Ser_ID[31]=0xff;
//  CAN2Ser_ID[1]=0xff;
//  CAN2Ser_ID[22]=0x11;
//
//  Order_MinF(32,CAN2Ser_ID);
	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_FDCAN1_Init();
	MX_FDCAN2_Init();
	MX_I2C1_Init();
	MX_USART1_UART_Init();
	MX_CRC_Init();
	MX_I2C3_Init();
	MX_SPI1_Init();
	MX_TIM6_Init();
	MX_TIM7_Init();
	MX_TIM14_Init();
	MX_ADC1_Init();
	MX_TIM16_Init();
	MX_TIM17_Init();
	MX_TIM1_Init();
	MX_TIM15_Init();
	MX_USART3_UART_Init();
	MX_USART2_UART_Init();
	/* USER CODE BEGIN 2 */

	///////use OLED for debug msg display
	HAL_Delay(300);
	OLED_Init(OLED_I2C_ch, OLED_type);
	OLED_Fill(OLED_I2C_ch, OLED_type, 0xff);
	HAL_Delay(1000);
	OLED_Fill(OLED_I2C_ch, OLED_type, 0x00);
	HAL_Delay(1000);

	HAL_FDCAN_MspInit(&hfdcan1);
	HAL_FDCAN_MspInit(&hfdcan2);

	Flash_SPI = &hspi1;

	TSA_Ack_Header.Identifier = 0x531;

	TSA_Ack_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA_Ack_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA_Ack_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA_Ack_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA_Ack_Header.IdType = FDCAN_STANDARD_ID;
	TSA_Ack_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA_Ack_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA_Ack_Header.MessageMarker = 0;

	TSA2_LS_Header.Identifier = 0x51;

	TSA2_LS_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA2_LS_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA2_LS_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA2_LS_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA2_LS_Header.IdType = FDCAN_STANDARD_ID;
	TSA2_LS_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA2_LS_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA2_LS_Header.MessageMarker = 0;

	TSA1_ADC_Header.Identifier = 0x50;

