YanqiS/stm32test/main - 副本.c
	TSA1_ADC_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA1_ADC_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA1_ADC_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA1_ADC_Header.TxFrameType = FDCAN_DATA_FRAME;	///*!< Data frame > < Remote frame */
	TSA1_ADC_Header.IdType = FDCAN_STANDARD_ID;
	TSA1_ADC_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA1_ADC_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA1_ADC_Header.MessageMarker = 0;

	TSA_GP_IN_Header.Identifier = 0x110;

	TSA_GP_IN_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA_GP_IN_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA_GP_IN_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA_GP_IN_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA_GP_IN_Header.IdType = FDCAN_STANDARD_ID;
	TSA_GP_IN_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA_GP_IN_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA_GP_IN_Header.MessageMarker = 0;

	MotrCtrl_1_TxHeader.Identifier = M1_ID;

	MotrCtrl_1_TxHeader.DataLength = FDCAN_DLC_BYTES_8;
	MotrCtrl_1_TxHeader.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	MotrCtrl_1_TxHeader.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	MotrCtrl_1_TxHeader.TxFrameType = FDCAN_DATA_FRAME;	///*!< Data frame > < Remote frame */
	MotrCtrl_1_TxHeader.IdType = FDCAN_STANDARD_ID;
	MotrCtrl_1_TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	MotrCtrl_1_TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	MotrCtrl_1_TxHeader.MessageMarker = 0;

	MotrCtrl_2_TxHeader.Identifier = M2_ID;

	MotrCtrl_2_TxHeader.DataLength = FDCAN_DLC_BYTES_8;
	MotrCtrl_2_TxHeader.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	MotrCtrl_2_TxHeader.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	MotrCtrl_2_TxHeader.TxFrameType = FDCAN_DATA_FRAME;	///*!< Data frame > < Remote frame */
	MotrCtrl_2_TxHeader.IdType = FDCAN_STANDARD_ID;
	MotrCtrl_2_TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	MotrCtrl_2_TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	MotrCtrl_2_TxHeader.MessageMarker = 0;

	MotrCtrl_3_TxHeader.Identifier = M3_ID;

	MotrCtrl_3_TxHeader.DataLength = FDCAN_DLC_BYTES_8;
	MotrCtrl_3_TxHeader.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	MotrCtrl_3_TxHeader.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	MotrCtrl_3_TxHeader.TxFrameType = FDCAN_DATA_FRAME;	///*!< Data frame > < Remote frame */
	MotrCtrl_3_TxHeader.IdType = FDCAN_STANDARD_ID;
	MotrCtrl_3_TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	MotrCtrl_3_TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	MotrCtrl_3_TxHeader.MessageMarker = 0;

////////TIM6定时器，20ms周期

	HAL_TIM_Base_Start_IT(&htim6);

////////TIM7定时器，100ms周期

	HAL_TIM_Base_Start_IT(&htim7);

////////TIM7定时器，1000ms周期

	HAL_TIM_Base_Start_IT(&htim14);

////////TIM16定时器，5ms周期

	HAL_TIM_Base_Start_IT(&htim16);

	////////TIM17定时器，1ms周期

	HAL_TIM_Base_Start_IT(&htim17);

	// 读取PCF8563的时间和日期
	//PCF8563_ReadDateTime(dateTimeBuffer);

	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */

	UART_Init(&huart1, Serial_Data_LENGTH);

//Mode check
	bool id1, id2, id3, id4;
	id1 = HAL_GPIO_ReadPin(GPIOD, IO_CFG_1_Pin);
	id2 = HAL_GPIO_ReadPin(GPIOA, IO_CFG_2_Pin);
	id3 = HAL_GPIO_ReadPin(GPIOA, IO_CFG_3_Pin);
	id4 = HAL_GPIO_ReadPin(GPIOA, IO_CFG_4_Pin);

	Mode_ID = (id1 << 3) + (id2 << 2) + (id3 << 1) + (id4 << 0);

	HAL_Delay(2000);

	if (id1 == 0)	//id1 = 0, no RC
			{
		char *str = "FW: ";
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, str);
	} else			//id1 = 1,with RC
	{
		char *str = "MoC ";
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, str);
	}

	char str1[16] = { 0 };
	itoa(Version_A, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 0, str1);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 5, 0, ".");
	itoa(Version_B, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 6, 0, str1);
	itoa(Version_C, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 7, 0, str1);


	if (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin) == 0) // DOWN键按下
	{
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold 5s Clear! ");
	    Sys_tune1();

	    uint8_t countdown = 5;
	    bool stillPressed = true;

	    // 倒计时5秒
	    for (int i = 0; i < 5; i++)
	    {
	        if (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin) != 0) // 松开了
	        {
	            stillPressed = false;
	            break;
	        }

	        char str_count[16];
	        itoa(countdown, str_count, 10);
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Countdown: ");
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 2, str_count);
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 13, 2, "s  ");

	        HAL_Delay(1000);
	        countdown--;
	    }

	    if (stillPressed && (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin) == 0))
	    {
	        // ⬅️ 清除Flash配置
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, "================");
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Clearing Flash! ");
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Please Wait...  ");
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "================");

	        Sys_tune1();  // ⬅️ 如果没有Sys_tune2就用Sys_tune1

	        // ⬅️⬅️⬅️ 关键：先切换SPI到Flash模式
	        SPI_Stop(Flash_SPI);
	        HAL_Delay(10);
	        SPI_Flash_Start(Flash_SPI);
	        HAL_Delay(10);

	        uint8_t clearData[4] = {0xFF, 0xFF, 0xFF, 0xFF};

	        // ⬅️⬅️⬅️ 重要：每次写入前都要加写使能！
	        SPI_Flash_WtritEnable();
	        HAL_Delay(5);
	        SPI_Flash_WriteSomeBytes(clearData, Sys_Addr_DispX0, sizeof(int));
	        HAL_Delay(50);

	        SPI_Flash_WtritEnable();
	        HAL_Delay(5);
	        SPI_Flash_WriteSomeBytes(clearData, Sys_Addr_DispX1, sizeof(int));
	        HAL_Delay(50);

	        SPI_Flash_WtritEnable();
	        HAL_Delay(5);
	        SPI_Flash_WriteSomeBytes(clearData, Sys_Addr_DispY0, sizeof(int));
	        HAL_Delay(50);

	        SPI_Flash_WtritEnable();
	        HAL_Delay(5);
	        SPI_Flash_WriteSomeBytes(clearData, Sys_Addr_DispY1, sizeof(int));
	        HAL_Delay(50);

