YanqiS/stm32test/main - 副本.c
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, "================");
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Config Cleared! ");
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Rebooting...    ");
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "================");

	        Sys_tune1();
	        HAL_Delay(2000);

	        // ⬅️ 自动重启（不需要等松开按键）
	        HAL_NVIC_SystemReset();
	    }
	    else
	    {
	        // 松开了，取消清除
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Clear Cancelled ");
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "                ");
	        HAL_Delay(1000);
	    }
	}

//	if (id1 == 1)	//id1 = 0, no RC
//			{
//		if (RCtrl_Mode_0m1p == 1) {
//			OLED_ShowString(OLED_I2C_ch, OLED_type, 14, 0, "%");
//			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "P/255 Control");
//		} else {
//			OLED_ShowString(OLED_I2C_ch, OLED_type, 14, 0, "mm");
//			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Position Mode");
//		}
//	}

	HAL_Delay(2000);

//	str = "|cfg: ";
//	OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 0, str );
//	OLED_ShowString(OLED_I2C_ch ,OLED_type,14, 0," .");

//	HAL_UART_Transmit(&huart2, "ATP_TD_mini Ready~", strlen("ATP_TD_mini Ready~") ,0xff);
//	HAL_UART_Transmit_IT(&huart1, "Hello TA531~", strlen("Hello TA531~") );

	for (int i = 0; i < CANMsg_MNumb; i++)	//
			{
		CAN_TxHeader[i].TxFrameType = FDCAN_DATA_FRAME;
		CAN_TxHeader[i].ErrorStateIndicator = FDCAN_ESI_PASSIVE;
		CAN_TxHeader[i].IdType = FDCAN_STANDARD_ID;
		CAN_TxHeader[i].MessageMarker = 0;
		CAN_TxHeader[i].TxEventFifoControl = FDCAN_NO_TX_EVENTS;

		FDCAN_TxHeader[i].TxFrameType = FDCAN_DATA_FRAME;
		FDCAN_TxHeader[i].ErrorStateIndicator = FDCAN_ESI_PASSIVE;
		FDCAN_TxHeader[i].IdType = FDCAN_STANDARD_ID;
		FDCAN_TxHeader[i].MessageMarker = 0;
		FDCAN_TxHeader[i].TxEventFifoControl = FDCAN_NO_TX_EVENTS;

		Ser2CAN_Msg[i].DataCycle = 0xffff;

		//		FDCAN1_TxHeader.IdType = FDCAN_STANDARD_ID;
		//		FDCAN1_TxHeader.DataLength = FDCAN_DLC_BYTES_8;
		//		FDCAN1_TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
		//		FDCAN1_TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
		//		FDCAN1_TxHeader.MessageMarker = 0;
		//		FDCAN1_TxHeader.TxFrameType = FDCAN_DATA_FRAME;	///*!< Data frame > < Remote frame */
	}

//	  HAL_Delay(500);

	uint8_t temp1[4],temp2[4];
	temp1[0] = 123;
	OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "Flash Test");
//	while( HAL_GPIO_ReadPin(ESP_TRG_STM_GPIO_Port,ESP_TRG_STM_Pin) )
//	{
//		SPI_Stop(Flash_SPI);
//		HAL_GPIO_WritePin(STM2ESP_GPIO_Port, STM2ESP_Pin, 0);
//		OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "Flash Test ...");
//	}
//	HAL_GPIO_WritePin(STM2ESP_GPIO_Port, STM2ESP_Pin, 0);	//#define STM2ESP_Pin GPIO_PIN_14		#define STM2ESP_GPIO_Port GPIOE

//	SPI_Stop(Flash_SPI);
//	HAL_Delay(5);
//
	SPI_Flash_Start(Flash_SPI);
	HAL_Delay(5);

	SPI_Flash_WtritEnable();
	HAL_Delay(5);
	SPI_Flash_WriteSomeBytes(temp1, Sys_Addr_DispTest, sizeof(int));
	HAL_Delay(5);
	SPI_Flash_ReadBytes(temp2, Sys_Addr_DispTest, sizeof(int));
	while(temp1[0] != temp2[0])
	{
		OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "Flash Test Err..");

		SPI_Stop(Flash_SPI);
		HAL_Delay(5);

		SPI_Flash_Start(Flash_SPI);
		HAL_Delay(5);

		SPI_Flash_WriteSomeBytes(temp1, Sys_Addr_DispTest, sizeof(int));
		HAL_Delay(5);
		SPI_Flash_ReadBytes(temp2, Sys_Addr_DispTest, sizeof(int));


		itoa(temp1[0],str1,16);
		OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 2, str1);
		itoa(temp1[1],str1,16);
		OLED_ShowString(OLED_I2C_ch ,OLED_type,4, 2, str1);
		itoa(temp2[0],str1,16);
		OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 2, str1);
		itoa(temp2[1],str1,16);
		OLED_ShowString(OLED_I2C_ch ,OLED_type,12, 2, str1);
	}


	OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "Flash Test OK!");
	HAL_Delay(1000);

	OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "UniqID:");
	uint64_t UID;

	HAL_Delay(1);
	UID = SPI_Flash_GUID();

	SPI_Stop(Flash_SPI);
//	HAL_GPIO_WritePin(STM2ESP_GPIO_Port, STM2ESP_Pin, 1);

	if ((UID == 0)|((UID&0xffff) == 0xffff))
	{
		OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 1, "Error! ");

		EncrypKey = 0x36;
	}else
	{
		itoa(UID,str1,16);
		OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 1, str1);

		EncrypKey = UID&0xff;
	}

	HAL_Delay(500);
////

//// ADC
	HAL_Delay(50);
	if (HAL_ADCEx_Calibration_Start(&hadc1) != HAL_OK) {
		char *str0 = "ADC_Calib_Error! ";
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str0);
		// 校准失败，处理错�???????????????????????????????????????
		Error_Handler();
		while (1)
			;
	}

	MX_DMA_Init();
	HAL_Delay(20);
	HAL_ADC_Start_DMA(&hadc1, (uint32_t*) adc_buffer, ADC_CHANNELS);

//    Sys_beep();
	Sys_tune1();

	if (id1 == 1)	//MoC
			{
		MoC_Init();
	}

//    Set_SystemReboot();

// 启动LIN接收
	HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
	HAL_UART_Receive_IT(&huart2, u2RxData, LIN_Data_LENGTH);
	HAL_UART_Receive_IT(&huart3, u3RxData, LIN_Data_LENGTH);

////// LIN init

	HAL_GPIO_WritePin(GPIOD, LIN1_EN_Pin, 1);
	HAL_GPIO_WritePin(GPIOC, LIN2_EN_Pin, 1);
	HAL_GPIO_WritePin(GPIOD, LIN3_EN_Pin, 1);

//	TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve01_1 = 1;
//	TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve02_8 = 255;
//	TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve03_7 = 127;

	////Init XL9555
	XL9555_Init( XL9555_1_addr_write, 1, 1);	//in in //out out
	XL9555_Init( XL9555_2_addr_write, 1, 1);	//in in //out out

	Motor_Protection_Init();

	while (1) {
		if (Remote_state == 1)	//LIN simulate or real
				{
			HAL_GPIO_WritePin(GPIOE, LIN_RELAY_Pin, 1);

		} else {
			HAL_GPIO_WritePin(GPIOE, LIN_RELAY_Pin, 0);
		}
		Lin_DataProcess_loop();

		if (id1 == 1)	//MoC
				{
			//// 实时显示当前坐标和光敏传感器
			// 第1行：当前坐标 X:xxx Y:yyy
			char str_coord[17];
			sprintf(str_coord, "X:%-3d Y:%-3d    ", TA531_RC1.TA531_RC_X_act, TA531_RC1.TA531_RC_Y_act);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str_coord);

