YanqiS/stm32test/main - 副本.c
			// 第2行：光敏传感器值 L1~L4
			char str_light[24];
			sprintf(str_light, "L:%d %d %d %d     ",
			    TA531SysEnv.TA531_env_LightA1,  // ← 改成A1
			    TA531SysEnv.TA531_env_LightA2,  // ← 改成A2
			    TA531SysEnv.TA531_env_LightA3,  // ← 改成A3
			    TA531SysEnv.TA531_env_LightA4); // ← 改成A4
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str_light);

			if ((TA531_RC1.TA531_RC_X_act == TA531_RC1.TA531_RC_X_trg)) {
			                TA531_RC1_x_ready = 1;
			            } else {
			                TA531_RC1_x_ready = 0;
			            }
			            if ((TA531_RC1.TA531_RC_Y_act == TA531_RC1.TA531_RC_Y_trg)) {
			                TA531_RC1_y_ready = 1;
			            } else {
			                TA531_RC1_y_ready = 0;
			            }

			            /* ====== 新增：运动开始前重置保护 ====== */
			            Motor_Protection_Reset();
			            Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
			            Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
			            /* ===================================== */

			            while ((TA531_RC1_fg == 2)
			                    & ((TA531_RC1_x_ready & TA531_RC1_y_ready) != 1)) {
			                MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg,
			                        TA531_RC1.TA531_RC_Y_trg);

			                char str_coord[17];
			                sprintf(str_coord, "X:%-3d Y:%-3d    ", TA531_RC1.TA531_RC_X_act, TA531_RC1.TA531_RC_Y_act);
			                OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str_coord);

			                HAL_Delay(100);

			                /* ====== 新增：异常检测与保护 ====== */
			                uint8_t protection_status = Motor_Protection_Check(
			                    TA531_RC1.TA531_RC_X_act,
			                    TA531_RC1.TA531_RC_Y_act,
			                    TA531_RC1.TA531_RC_X_trg,
			                    TA531_RC1.TA531_RC_Y_trg
			                );

			                if (protection_status != 0) {
			                    Motor_Protection_EmergencyStop();
			                    break;
			                }
			                /* ================================== */

			                if ((TA531_RC1.TA531_RC_X_act == TA531_RC1.TA531_RC_X_trg)) {
			                    TA531_RC1_x_ready = 1;
			                } else {
			                    TA531_RC1_x_ready = 0;
			                }
			                if ((TA531_RC1.TA531_RC_Y_act == TA531_RC1.TA531_RC_Y_trg)) {
			                    TA531_RC1_y_ready = 1;
			                } else {
			                    TA531_RC1_y_ready = 0;
			                }
			            }

			if ((TA531_RC1_x_ready == 1) & (TA531_RC1_y_ready == 1)
					& (TA531_RC1_fg < 3)) {	//reach 1st point

				if (TA531_RC1.TA531_RC_Z_code > 0)//(TA531_RC1.TA531_RC_Z_code2 != TA531_RC1.TA531_RC_Z_code)
						{
					switch (TA531_RC1.TA531_RC_Z_code) {
					case 0:		//none
						HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 0);
						break;
					case 1:
						HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 1);	//F
						HAL_Delay(250);
						break;
					case 2:
						HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 1);	//F
						HAL_Delay(2000);
						break;
					case 3:
						HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 1);	//F
						HAL_Delay(5000);
						break;
					}

					if ((TA531_RC1.TA531_RC_X_Mov != 0)
							| (TA531_RC1.TA531_RC_Y_Mov != 0)) {
					    int temp_x = (int)(TA531_RC1.TA531_RC_X_trg + TA531_RC1.TA531_RC_X_Mov);
					    int temp_y = (int)(TA531_RC1.TA531_RC_Y_trg + TA531_RC1.TA531_RC_Y_Mov);
					    Clamp_Position(&temp_x, &temp_y, false);  // ← 添加限制
					    MotoCtrl_PositionLoop(temp_x, temp_y);
					    HAL_Delay(500);
					}

					HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 0);	//F
					TA531_RC1.TA531_RC_Z_code2 = TA531_RC1.TA531_RC_Z_code;	// 0
					TA531_RC1.TA531_RC_X_Mov = 0;
					TA531_RC1.TA531_RC_Y_Mov = 0;

					TA531_RC1.TA531_RC_Z_code = 0;
				}

				if (TA531_RC1.TA531_RC_Reset == 1) {
				                    /* ====== 新增：复位前重置保护 ====== */
				                    Motor_Protection_Reset();
				                    Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
				                    Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
				                    /* ================================== */

				                    TA531_RC1.TA531_RC_X_trg = 0;
				                    TA531_RC1.TA531_RC_Y_trg = 0;
				                    MotoCtrl_PositionLoop(0, 0);
				                    HAL_Delay(1500);

				                    /* ====== 新增：检查复位是否成功 ====== */
				                    if (abs(TA531_RC1.TA531_RC_X_act) > 10 ||
				                        abs(TA531_RC1.TA531_RC_Y_act) > 10) {
				                        Motor_Protection.protection_triggered = 1;
				                        Motor_Protection.error_type = 2;
				                        Motor_Protection_EmergencyStop();
				                    }
				                    /* ==================================== */
				                }

				TA531_RC1_fg = 3;

			    TA531_Lock = 0;  // 关键：动作完成后自动解锁！
			    TA531_RC1.TA531_RC_Reset = 0;
			    TA531_RC1.TA531_RC_Z_code = 0;
			    TA531_RC1.TA531_RC_X_Mov = 0;
			    TA531_RC1.TA531_RC_Y_Mov = 0;



				TSA_Ack_RC_DATA[0] = TA531_RC1_Ack & 0x0f;
				TSA_Ack_RC_DATA[3] = TA531_RC1.TA531_RC_X_act & 0xff;
				TSA_Ack_RC_DATA[4] = (TA531_RC1.TA531_RC_X_act >> 8) & 0xff;
				TSA_Ack_RC_DATA[5] = TA531_RC1.TA531_RC_Y_act & 0xff;
				TSA_Ack_RC_DATA[6] = (TA531_RC1.TA531_RC_Y_act >> 8) & 0xff;
				TSA_Ack_RC_DATA[7] = 0xff;

				HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_Ack_RC_Header,
						TSA_Ack_RC_DATA);
			}

			if (TA531_Lock == 0) {
			    // UP键处理 - 添加时间判断
			    if ((SW_UP == 1) & (SW_UP_cnt >= 3)) {  // 按住 >= 300ms (3次扫描)
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Go X+ (Long)   ");
			        TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act + 50;  // 长按步长
			        Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);
			        TA531_RC1_fg = 2;
			    }
			    else if ((SW_UP == 1) & (SW_UP_pre == 0)) {  // 首次按下
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Go X+ (Short)  ");
			        TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act + 20;  // 短按步长
			        Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);
			        TA531_RC1_fg = 2;
			    }

