YanqiS/stm32test/main - 副本.c
			    // DOWN键处理
			    else if ((SW_DW == 1) & (SW_DW_cnt >= 3)) {  // 按住 >= 300ms
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Go X- (Long)   ");
			        TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act - 50;
			        Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);
			        if (TA531_RC1.TA531_RC_X_trg < 0) {
			            TA531_RC1.TA531_RC_X_trg = 0;
			        }
			        TA531_RC1_fg = 2;
			    }
			    else if ((SW_DW == 1) & (SW_DW_pre == 0)) {
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Go X- (Short)  ");
			        TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act - 20;
			        Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);
			        if (TA531_RC1.TA531_RC_X_trg < 0) {
			            TA531_RC1.TA531_RC_X_trg = 0;
			        }
			        TA531_RC1_fg = 2;
			    }

			    // LEFT键处理
			    else if ((SW_LEFT == 1) & (SW_LEFT_cnt >= 3)) {  // 按住 >= 300ms
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Go Y- (Long)   ");
			        TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act - 50;
			        Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);
			        if (TA531_RC1.TA531_RC_Y_trg < 0) {
			            TA531_RC1.TA531_RC_Y_trg = 0;
			        }
			        TA531_RC1_fg = 2;
			    }
			    else if ((SW_LEFT == 1) & (SW_LEFT_pre == 0)) {
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Go Y- (Short)  ");
			        TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act - 20;
			        Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);
			        if (TA531_RC1.TA531_RC_Y_trg < 0) {
			            TA531_RC1.TA531_RC_Y_trg = 0;
			        }
			        TA531_RC1_fg = 2;
			    }

			    // RIGHT键处理
			    else if ((SW_RIGHT == 1) & (SW_RIGHT_cnt >= 3)) {  // 按住 >= 300ms
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Go Y+ (Long)   ");
			        TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act + 50;
			        Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);
			        TA531_RC1_fg = 2;
			    }
			    else if ((SW_RIGHT == 1) & (SW_RIGHT_pre == 0)) {
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Go Y+ (Short)  ");
			        TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act + 20;
			        Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);
			        TA531_RC1_fg = 2;
			    }

			    else if (SW_BUTTON == 1) {
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Push!          ");
			        TA531_RC1.TA531_RC_Z_code = 1;
			        TA531_RC1.TA531_RC_Z_code2 = 0;
			        TA531_RC1_fg = 2;
			    }
			    else {
			        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "               ");
			    }
			}

		}	//	end if MoC

/////////// XL9555
//	    uint8_t XL9555_tempdata;
//	    XL9555_tempdata = XL9555_Read(XL9555_1_addr_read, 0);
//		itoa(XL9555_tempdata,str1,2);
//		OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 3, str1);
//
//	    XL9555_tempdata = XL9555_Read(XL9555_1_addr_read, 1);
//		itoa(XL9555_tempdata,str1,2);
//		OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 3, str1);
//
//
//		//TSA_GP_IN_DATA

///////// Light Sensor
		TA531SysEnv.TA531_env_LightA1 = adc_buffer[0] * 255 / 4095;
		TA531SysEnv.TA531_env_LightA2 = adc_buffer[1] * 255 / 4095;
		TA531SysEnv.TA531_env_LightA3 = adc_buffer[2] * 255 / 4095;
		TA531SysEnv.TA531_env_LightA4 = adc_buffer[3] * 255 / 4095;

		if (TA531SysEnv.TA531_env_LightA1 < LightSensr_Gate) {
			if (TA531SysEnv.TA531_env_LightA1 < LightSensr_Gate / 2) {
				if (TA531SysEnv.TA531_env_LightA1 < LightSensr_Gate / 3) {
					TA531SysEnv.TA531_env_LightD1 = 3;
				} else {
					TA531SysEnv.TA531_env_LightD1 = 2;
				}
			} else {
				TA531SysEnv.TA531_env_LightD1 = 1;
			}
		} else {
			TA531SysEnv.TA531_env_LightD1 = 0;
		}

		if (TA531SysEnv.TA531_env_LightA2 < LightSensr_Gate) {
			if (TA531SysEnv.TA531_env_LightA2 < LightSensr_Gate / 2) {
				if (TA531SysEnv.TA531_env_LightA2 < LightSensr_Gate / 3) {
					TA531SysEnv.TA531_env_LightD2 = 3;
				} else {
					TA531SysEnv.TA531_env_LightD2 = 2;
				}
			} else {
				TA531SysEnv.TA531_env_LightD2 = 1;
			}
		} else {
			TA531SysEnv.TA531_env_LightD2 = 0;
		}

		if (TA531SysEnv.TA531_env_LightA3 < LightSensr_Gate) {
			if (TA531SysEnv.TA531_env_LightA3 < LightSensr_Gate / 2) {
				if (TA531SysEnv.TA531_env_LightA3 < LightSensr_Gate / 3) {
					TA531SysEnv.TA531_env_LightD3 = 3;
				} else {
					TA531SysEnv.TA531_env_LightD3 = 2;
				}
			} else {
				TA531SysEnv.TA531_env_LightD3 = 1;
			}
		} else {
			TA531SysEnv.TA531_env_LightD3 = 0;
		}

		if (TA531SysEnv.TA531_env_LightA4 < LightSensr_Gate) {
			if (TA531SysEnv.TA531_env_LightA4 < LightSensr_Gate / 2) {
				if (TA531SysEnv.TA531_env_LightA4 < LightSensr_Gate / 3) {
					TA531SysEnv.TA531_env_LightD4 = 3;
				} else {
					TA531SysEnv.TA531_env_LightD4 = 2;
				}
			} else {
				TA531SysEnv.TA531_env_LightD4 = 1;
			}
		} else {
			TA531SysEnv.TA531_env_LightD4 = 0;
		}

//	TSA1_ADC_DATA[8], TSA2_LS_DATA[8]

		TSA2_LS_DATA[0] = (TA531SysEnv.TA531_env_LightD1 & 0x03)
				+ ((TA531SysEnv.TA531_env_LightD2 & 0x03) << 2)
				+ ((TA531SysEnv.TA531_env_LightD3 & 0x03) << 4)
				+ ((TA531SysEnv.TA531_env_LightD4 & 0x03) << 6);
		TSA2_LS_DATA[2] = TA531SysEnv.TA531_env_LightA1 & 0xff;
		TSA2_LS_DATA[3] = TA531SysEnv.TA531_env_LightA2 & 0xff;
		TSA2_LS_DATA[4] = TA531SysEnv.TA531_env_LightA3 & 0xff;
		TSA2_LS_DATA[5] = TA531SysEnv.TA531_env_LightA4 & 0xff;

//		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA2_LS_Header, TSA2_LS_DATA);

//////////ADC
		TA531SysEnv.TA531_env_ADC1 = adc_buffer[4] * 0.056;
		//TA531SysEnv.TA531_env_ADC2 = adc_buffer[5]  *0.056;	//*32.50 / 4096 /1.65 *11.65;

		TSA1_ADC_DATA[0] = TA531SysEnv.TA531_env_ADC1 & 0xff;
		//TSA1_ADC_DATA[1] = TA531SysEnv.TA531_env_ADC2 & 0xff;

		//	HAL_Delay(20);

		if (id1 == 0)	//id1 = 0, no RC
				{
			itoa(TA531SysEnv.TA531_env_LightA1, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str1);
			itoa(TA531SysEnv.TA531_env_LightA2, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 1, str1);
			itoa(TA531SysEnv.TA531_env_LightA3, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 1, str1);
			itoa(TA531SysEnv.TA531_env_LightA4, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 12, 1, str1);

