YanqiS/stm32test/main - 副本.c
			itoa(TA531SysEnv.TA531_env_LightD1, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str1);
			itoa(TA531SysEnv.TA531_env_LightD2, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 2, str1);
			itoa(TA531SysEnv.TA531_env_LightD3, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, str1);
			itoa(TA531SysEnv.TA531_env_LightD4, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 12, 2, str1);

			itoa(TA531SysEnv.TA531_env_ADC1, str1, 10);
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, str1);
//			itoa(TA531SysEnv.TA531_env_ADC2,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 3, str1);
		}

//		itoa(TA531_LIN_SWS.LIN_SWS_SWSSelUpSwA_1,str1,10);	//SWS_0x00_Data[4]
//		OLED_ShowString(OLED_I2C_ch ,OLED_type,12, 0, str1);
//
//		itoa(SWS_0x00_Data[4],str1,10);	//SWS_0x00_Data[4]
//		OLED_ShowString(OLED_I2C_ch ,OLED_type,14, 0, str1);

		if (TSA3_0x52_Flag == 1) {
			if (TA531SysEnv.TA531_env_KL15 == 1) {
				HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 1);	//F
//				char *str = "*KL15 Relay ON";
//				OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 2, str );
			} else if (TA531SysEnv.TA531_env_KL15 == 0) {
				HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);
			}

			if (TA531SysEnv.TA531_env_USB1 == 0) {
				HAL_GPIO_WritePin(GPIOF, USB_RELAY_1_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_USB1 == 1) {
				HAL_GPIO_WritePin(GPIOF, USB_RELAY_1_Pin, 1);
				HAL_GPIO_WritePin(GPIOF, USB_RELAY_2_Pin, 0);
			} else if (TA531SysEnv.TA531_env_USB1 == 2) {
				HAL_GPIO_WritePin(GPIOF, USB_RELAY_1_Pin, 1);
				HAL_GPIO_WritePin(GPIOF, USB_RELAY_2_Pin, 1);
			}

			// 1			//		TA531SysEnv.TA531_env_KeyLock = (buf_rec[2]>>0)&0x03;
			if ((TA531SysEnv.TA531_env_KeyLock == 0)
					& (TA531TimCallback.TA531_Callback_flag[1] == 0)) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_1_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_KeyLock == 3) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_1_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyLock == 1)	//1s
					{
//				uint8_t TA531_Callback_flag[8] ;
//				uint8_t TA531_Callback_key[8] ;
//				uint32_t TA531_Callback_tim[8] ;

				HAL_GPIO_WritePin(GPIOE, COM_RELAY_1_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[1] = 1;
				TA531TimCallback.TA531_Callback_tim[1] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_1_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[1] = 1;
				TA531TimCallback.TA531_Callback_tim[1] = Sys_TIM_TICK + 6000;
			}

			// 2			//		TA531SysEnv.TA531_env_KeyUnlock = (buf_rec[2]>>2)&0x03;
			if ((TA531SysEnv.TA531_env_KeyUnlock == 0)
					& (TA531TimCallback.TA531_Callback_flag[2] == 0)) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_2_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_KeyUnlock == 3) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_2_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyUnlock == 1)	//1s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_2_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[2] = 1;
				TA531TimCallback.TA531_Callback_tim[2] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_2_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[2] = 1;
				TA531TimCallback.TA531_Callback_tim[2] = Sys_TIM_TICK + 6000;
			}

			// 3		//		TA531SysEnv.TA531_env_KeyRearDoor = (buf_rec[2]>>4)&0x03;
			if ((TA531SysEnv.TA531_env_KeyRearDoor == 0)
					& (TA531TimCallback.TA531_Callback_flag[3] == 0)) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_3_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_KeyRearDoor == 3) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_3_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyRearDoor == 1)	//1s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_3_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[3] = 1;
				TA531TimCallback.TA531_Callback_tim[3] = Sys_TIM_TICK + 1500;

			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_3_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[3] = 1;
				TA531TimCallback.TA531_Callback_tim[3] = Sys_TIM_TICK + 6000;
			}

			// 4		//		TA531SysEnv.TA531_env_KeyBeep = (buf_rec[2]>>6)&0x03;
			if ((TA531SysEnv.TA531_env_KeyBeep == 0)
					& (TA531TimCallback.TA531_Callback_flag[4] == 0)) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_4_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_KeyBeep == 3) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_4_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyBeep == 1)	//1s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_4_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[4] = 1;
				TA531TimCallback.TA531_Callback_tim[4] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyBeep == 2)	//6s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_4_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[4] = 1;
				TA531TimCallback.TA531_Callback_tim[4] = Sys_TIM_TICK + 6000;
			}

			// 5		//		TA531SysEnv.TA531_env_KeyWindow = (buf_rec[3]>>0)&0x03;
			if ((TA531SysEnv.TA531_env_KeyWindow == 0)
					& (TA531TimCallback.TA531_Callback_flag[5] == 0)) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_5_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_KeyWindow == 3) {
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_5_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyWindow == 1)	//1s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_5_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[5] = 1;
				TA531TimCallback.TA531_Callback_tim[5] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyWindow == 2)	//6s
					{
				HAL_GPIO_WritePin(GPIOE, COM_RELAY_5_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[5] = 1;
				TA531TimCallback.TA531_Callback_tim[5] = Sys_TIM_TICK + 6000;
			}

			// 6		//		TA531SysEnv.TA531_env_KeyLeftDoor = (buf_rec[3]>>2)&0x03;
			if ((TA531SysEnv.TA531_env_KeyLeftDoor == 0)
					& (TA531TimCallback.TA531_Callback_flag[6] == 0)) {
				HAL_GPIO_WritePin(GPIOB, COM_RELAY_6_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_KeyLeftDoor == 3) {
				HAL_GPIO_WritePin(GPIOB, COM_RELAY_6_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyLeftDoor == 1)	//1s
					{
				HAL_GPIO_WritePin(GPIOB, COM_RELAY_6_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[6] = 1;
				TA531TimCallback.TA531_Callback_tim[6] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyLeftDoor == 2)	//6s
					{
				HAL_GPIO_WritePin(GPIOB, COM_RELAY_6_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[6] = 1;
				TA531TimCallback.TA531_Callback_tim[6] = Sys_TIM_TICK + 6000;
			}

