YanqiS/stm32test/main - 副本.c
			// 7		//		TA531SysEnv.TA531_env_KeyRightDoor = (buf_rec[3]>>4)&0x03;
			if ((TA531SysEnv.TA531_env_KeyRightDoor == 0)
					& (TA531TimCallback.TA531_Callback_flag[7] == 0)) {
				HAL_GPIO_WritePin(GPIOB, COM_RELAY_7_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_KeyRightDoor == 3) {
				HAL_GPIO_WritePin(GPIOB, COM_RELAY_7_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyRightDoor == 1)	//1s
					{
				HAL_GPIO_WritePin(GPIOB, COM_RELAY_7_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[7] = 1;
				TA531TimCallback.TA531_Callback_tim[7] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyRightDoor == 2)	//6s
					{
				HAL_GPIO_WritePin(GPIOB, COM_RELAY_7_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[7] = 1;
				TA531TimCallback.TA531_Callback_tim[7] = Sys_TIM_TICK + 6000;
			}

			if (TA531SysEnv.TA531_env_Relay1 == 1)	//			A Y_RELAY_1_Pin
					{
				HAL_GPIO_WritePin(GPIOA, Y_RELAY_1_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay1 == 2) {
				HAL_GPIO_WritePin(GPIOA, Y_RELAY_1_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay2 == 1)	//
					{
				HAL_GPIO_WritePin(GPIOA, Y_RELAY_2_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay2 == 2) {
				HAL_GPIO_WritePin(GPIOA, Y_RELAY_2_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay3 == 1)	//
					{
				HAL_GPIO_WritePin(GPIOA, Y_RELAY_3_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay3 == 2) {
				HAL_GPIO_WritePin(GPIOA, Y_RELAY_3_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay4 == 1)	//
					{
				HAL_GPIO_WritePin(GPIOA, Y_RELAY_4_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay4 == 2) {
				HAL_GPIO_WritePin(GPIOA, Y_RELAY_4_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay5 == 1)	//			B
					{
				HAL_GPIO_WritePin(GPIOB, Y_RELAY_5_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay5 == 2) {
				HAL_GPIO_WritePin(GPIOB, Y_RELAY_5_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay6 == 1)	//			B
					{
				HAL_GPIO_WritePin(GPIOB, Y_RELAY_6_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay6 == 2) {
				HAL_GPIO_WritePin(GPIOB, Y_RELAY_6_Pin, 1);
			}

			TSA_Ack_DATA[3] = 0xff;
			TSA3_0x52_Flag = 0;
		}

		if (TSA4_0x53_Flag == 1) {

			if (TA531SysEnv.TA531_env_WindowFL == 0)//			B		//无输�????????????????????	上升	手动
					{
//				HAL_GPIO_WritePin(GPIOB, FL_WINDORELAY_1_Pin, 0);	//FL  BACC
//				HAL_GPIO_WritePin(GPIOA, FL_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowFL == 1)	//			B
					{
//				HAL_GPIO_WritePin(GPIOB, FL_WINDORELAY_1_Pin, 1);	//FL  BACC
//				HAL_GPIO_WritePin(GPIOA, FL_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowFL == 2) {
//				HAL_GPIO_WritePin(GPIOB, FL_WINDORELAY_1_Pin, 1);	//FL  BACC
//				HAL_GPIO_WritePin(GPIOA, FL_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_3_Pin, 1);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowFL == 3) {
//				HAL_GPIO_WritePin(GPIOB, FL_WINDORELAY_1_Pin, 1);	//FL  BACC
//				HAL_GPIO_WritePin(GPIOA, FL_WINDORELAY_2_Pin, 1);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowFL == 4) {
//				HAL_GPIO_WritePin(GPIOB, FL_WINDORELAY_1_Pin, 1);	//FL  BACC
//				HAL_GPIO_WritePin(GPIOA, FL_WINDORELAY_2_Pin, 1);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOC, FL_WINDORELAY_4_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_WindowFR == 0)	//			B
					{
//				HAL_GPIO_WritePin(GPIOF, FR_WINDORELAY_1_Pin, 0);	//FR  FDDD
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowFR == 1)	//			B
					{
//				HAL_GPIO_WritePin(GPIOF, FR_WINDORELAY_1_Pin, 1);	//FR  FDDD
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowFR == 2) {
//				HAL_GPIO_WritePin(GPIOF, FR_WINDORELAY_1_Pin, 1);	//FR  FDDD
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_3_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowFR == 3) {
//				HAL_GPIO_WritePin(GPIOF, FR_WINDORELAY_1_Pin, 1);	//FR  FDDD
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_2_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowFR == 4) {
//				HAL_GPIO_WritePin(GPIOF, FR_WINDORELAY_1_Pin, 1);	//FR  FDDD
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_2_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, FR_WINDORELAY_4_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_WindowRL == 0)	//			RL DDDD
					{
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_1_Pin, 0);	//
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowRL == 1)	//			RL DDDD
					{
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_1_Pin, 1);	//
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowRL == 2) {
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_1_Pin, 1);	//
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_3_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowRL == 3) {
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_1_Pin, 1);	//
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_2_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowRL == 4) {
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_1_Pin, 1);	//
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_2_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RL_WINDORELAY_4_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_WindowRR == 0)	//			RR DDDD
					{
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_1_Pin, 0);	//
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowRR == 1)	//			RR DDDD
					{
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_1_Pin, 1);	//
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowRR == 2) {
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_1_Pin, 1);	//
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_2_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_3_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowRR == 3) {
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_1_Pin, 1);	//
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_2_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_4_Pin, 0);
			} else if (TA531SysEnv.TA531_env_WindowRR == 4) {
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_1_Pin, 1);	//
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_2_Pin, 1);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_3_Pin, 0);
//				HAL_GPIO_WritePin(GPIOD, RR_WINDORELAY_4_Pin, 1);
			}

			//
			if (TA531SysEnv.TA531_env_DoorSwF == 0)	//
					{
				HAL_GPIO_WritePin(GPIOB, DOOR_RELAY_F_Pin, 0);	//
			} else if (TA531SysEnv.TA531_env_DoorSwF == 1)	//
					{
				HAL_GPIO_WritePin(GPIOB, DOOR_RELAY_F_Pin, 1);	//
			}

