YanqiS/stm32test/main - 副本.c
			if (TA531SysEnv.TA531_env_DoorSwR == 0)	//
					{
				HAL_GPIO_WritePin(GPIOB, DOOR_RELAY_R_Pin, 0);	//
			} else if (TA531SysEnv.TA531_env_DoorSwR == 1)	//
					{
				HAL_GPIO_WritePin(GPIOB, DOOR_RELAY_R_Pin, 1);	//
			}

			if (TA531SysEnv.TA531_env_DoorSwFL == 0)	//
					{
				HAL_GPIO_WritePin(GPIOE, DOOR_RELAY_FL_Pin, 0);	//
			} else if (TA531SysEnv.TA531_env_DoorSwFL == 1)	//
					{
				HAL_GPIO_WritePin(GPIOE, DOOR_RELAY_FL_Pin, 1);	//
			}

			if (TA531SysEnv.TA531_env_DoorSwFR == 0)	//
					{
				HAL_GPIO_WritePin(GPIOE, DOOR_RELAY_FR_Pin, 0);	//
			} else if (TA531SysEnv.TA531_env_DoorSwFL == 1)	//
					{
				HAL_GPIO_WritePin(GPIOE, DOOR_RELAY_FR_Pin, 1);	//
			}

			if (TA531SysEnv.TA531_env_DoorSwRL == 0)	//
					{
				HAL_GPIO_WritePin(GPIOB, DOOR_RELAY_RL_Pin, 0);	//
			} else if (TA531SysEnv.TA531_env_DoorSwRL == 1)	//
					{
				HAL_GPIO_WritePin(GPIOB, DOOR_RELAY_RL_Pin, 1);	//
			}

			//		TA531SysEnv.TA531_env_DoorSwRR = (buf_rec[5]>>6)&0x03;
			if (TA531SysEnv.TA531_env_DoorSwRR == 0)	//
					{
				HAL_GPIO_WritePin(GPIOE, DOOR_RELAY_RR_Pin, 0);	//
			} else if (TA531SysEnv.TA531_env_DoorSwRR == 1)	//
					{
				HAL_GPIO_WritePin(GPIOE, DOOR_RELAY_RR_Pin, 1);	//
			}

			if (TA531SysEnv.TA531_env_HSD12_1 == 0)	//
					{
				HAL_GPIO_WritePin(GPIOC, DOOR_RELAY_HSD1_Pin, 0);
			} else if (TA531SysEnv.TA531_env_HSD12_1 == 1)	//
					{
				HAL_GPIO_WritePin(GPIOC, DOOR_RELAY_HSD1_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_HSD12_2 == 0)	//
					{
				HAL_GPIO_WritePin(GPIOC, DOOR_RELAY_HSD2_Pin, 0);
			} else if (TA531SysEnv.TA531_env_HSD12_2 == 1)	//
					{
				HAL_GPIO_WritePin(GPIOC, DOOR_RELAY_HSD2_Pin, 1);
			}

			TSA4_0x53_Flag = 0;
			TSA_Ack_DATA[4] = 0xff;
		}

		//		uint8_t TA531_Callback_flag[8] ;
		//		uint8_t TA531_Callback_key[8] ;
		//		uint32_t TA531_Callback_tim[8] ;
		for (int i = 1; i < 8; i++)		//release key
				{
			if (TA531TimCallback.TA531_Callback_flag[i] == 1) {
				if (TA531TimCallback.TA531_Callback_tim[i] < Sys_TIM_TICK) {
					switch (i) {
					case 1:		//
						HAL_GPIO_WritePin(GPIOE, COM_RELAY_1_Pin, 0);
						break;
					case 2:		//
						HAL_GPIO_WritePin(GPIOE, COM_RELAY_2_Pin, 0);
						break;
					case 3:		//
						HAL_GPIO_WritePin(GPIOE, COM_RELAY_3_Pin, 0);
						break;
					case 4:		//
						HAL_GPIO_WritePin(GPIOE, COM_RELAY_4_Pin, 0);
						break;
					case 5:		//
						HAL_GPIO_WritePin(GPIOE, COM_RELAY_5_Pin, 0);
						break;
					case 6:		//
						HAL_GPIO_WritePin(GPIOB, COM_RELAY_6_Pin, 0);
						break;
					case 7:		//
						HAL_GPIO_WritePin(GPIOB, COM_RELAY_7_Pin, 0);
						break;
					}

					TA531TimCallback.TA531_Callback_flag[i] = 0;
				}
			}
		}

	}  //while

	/* USER CODE END WHILE */

	/* USER CODE BEGIN 3 */

	/* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

	/** Configure the main internal regulator output voltage
	 */
	HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

	/** Initializes the RCC Oscillators according to the specified parameters
	 * in the RCC_OscInitTypeDef structure.
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV2;
	RCC_OscInitStruct.PLL.PLLN = 16;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
	RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV3;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	/** Initializes the CPU, AHB and APB buses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) {
		Error_Handler();
	}
}

/**
 * @brief ADC1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_ADC1_Init(void) {

	/* USER CODE BEGIN ADC1_Init 0 */

	/* USER CODE END ADC1_Init 0 */

	ADC_ChannelConfTypeDef sConfig = { 0 };

	/* USER CODE BEGIN ADC1_Init 1 */

	/* USER CODE END ADC1_Init 1 */

	/** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
	 */
	hadc1.Instance = ADC1;
	hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
	hadc1.Init.Resolution = ADC_RESOLUTION_12B;
	hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
	hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
	hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;
	hadc1.Init.LowPowerAutoWait = DISABLE;
	hadc1.Init.LowPowerAutoPowerOff = DISABLE;
	hadc1.Init.ContinuousConvMode = DISABLE;
	hadc1.Init.NbrOfConversion = 5;
	hadc1.Init.DiscontinuousConvMode = DISABLE;
	hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
	hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
	hadc1.Init.DMAContinuousRequests = DISABLE;
	hadc1.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
	hadc1.Init.SamplingTimeCommon1 = ADC_SAMPLETIME_7CYCLES_5;
	hadc1.Init.SamplingTimeCommon2 = ADC_SAMPLETIME_7CYCLES_5;
	hadc1.Init.OversamplingMode = DISABLE;
	hadc1.Init.TriggerFrequencyMode = ADC_TRIGGER_FREQ_HIGH;
	if (HAL_ADC_Init(&hadc1) != HAL_OK) {
		Error_Handler();
	}

	/** Configure Regular Channel
	 */
	sConfig.Channel = ADC_CHANNEL_0;
	sConfig.Rank = ADC_REGULAR_RANK_1;
	sConfig.SamplingTime = ADC_SAMPLINGTIME_COMMON_1;
	if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
		Error_Handler();
	}

	/** Configure Regular Channel
	 */
	sConfig.Channel = ADC_CHANNEL_1;
	sConfig.Rank = ADC_REGULAR_RANK_2;
	if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
		Error_Handler();
	}

