YanqiS/stm32test/main - 副本.c
	/*Configure GPIO pins : IO_CFG_2_Pin IO_CFG_3_Pin IO_CFG_4_Pin LIN2_NRES_Pin */
	GPIO_InitStruct.Pin = IO_CFG_2_Pin | IO_CFG_3_Pin | IO_CFG_4_Pin
			| LIN2_NRES_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/*Configure GPIO pin : LIN3_NRES_Pin */
	GPIO_InitStruct.Pin = LIN3_NRES_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(LIN3_NRES_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pin : LIN2_EN_Pin */
	GPIO_InitStruct.Pin = LIN2_EN_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(LIN2_EN_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pins : SW_UP_Pin SW_BUTTON_Pin */
	GPIO_InitStruct.Pin = SW_UP_Pin | SW_BUTTON_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

	/*Configure GPIO pins : SW_LEFT_Pin SW_DOWN_Pin SW_RIGHT_Pin */
	GPIO_InitStruct.Pin = SW_LEFT_Pin | SW_DOWN_Pin | SW_RIGHT_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	/*Configure GPIO pins : IO_SYS_LED_B_Pin IO_SYS_LED_G_Pin IO_SYS_LED_R_Pin */
	GPIO_InitStruct.Pin =
			IO_SYS_LED_B_Pin | IO_SYS_LED_G_Pin | IO_SYS_LED_R_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

	/*Configure GPIO pins : DOOR_RELAY_RL_Pin DOOR_RELAY_F_Pin DOOR_RELAY_R_Pin */
	GPIO_InitStruct.Pin = DOOR_RELAY_RL_Pin | DOOR_RELAY_F_Pin
			| DOOR_RELAY_R_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_PULLDOWN;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	/**/
	__HAL_SYSCFG_FASTMODEPLUS_ENABLE(SYSCFG_FASTMODEPLUS_PB6);

	/**/
	__HAL_SYSCFG_FASTMODEPLUS_ENABLE(SYSCFG_FASTMODEPLUS_PB7);

	/**/
	__HAL_SYSCFG_FASTMODEPLUS_ENABLE(SYSCFG_FASTMODEPLUS_PB8);

	/* USER CODE BEGIN MX_GPIO_Init_2 */
	/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef *hfdcan, uint32_t RxFifo0ITs)
{
	if ((RxFifo0ITs & FDCAN_IT_RX_FIFO0_NEW_MESSAGE) != RESET)
	{
		if (hfdcan == &hfdcan1) 	//CAN1 Classic CAN
		{
			uint8_t buf_rec[8];

			while(HAL_FDCAN_GetRxFifoFillLevel(&hfdcan1, FDCAN_RX_FIFO0))
			{
				HAL_FDCAN_GetRxMessage(&hfdcan1, FDCAN_RX_FIFO0, &FDCAN1_RxHeader, buf_rec);

				TA531_Lock = 1;
				Remote_state = 1;

			if (FDCAN1_RxHeader.Identifier == 0x052)	//TSA_3
					{
				TA531SysEnv.TA531_env_KL15 = buf_rec[0] & 0x03;
				TA531SysEnv.TA531_env_USB1 = buf_rec[1] & 0x0F;
				TA531SysEnv.TA531_env_KeyLock = (buf_rec[2] >> 0) & 0x03;
				TA531SysEnv.TA531_env_KeyUnlock = (buf_rec[2] >> 2) & 0x03;
				TA531SysEnv.TA531_env_KeyRearDoor = (buf_rec[2] >> 4) & 0x03;
				TA531SysEnv.TA531_env_KeyBeep = (buf_rec[2] >> 6) & 0x03;

				TA531SysEnv.TA531_env_KeyWindow = (buf_rec[3] >> 0) & 0x03;
				TA531SysEnv.TA531_env_KeyLeftDoor = (buf_rec[3] >> 2) & 0x03;
				TA531SysEnv.TA531_env_KeyRightDoor = (buf_rec[3] >> 4) & 0x03;

				TA531SysEnv.TA531_env_Relay1 = (buf_rec[4] >> 0) & 0x03;
				TA531SysEnv.TA531_env_Relay2 = (buf_rec[4] >> 2) & 0x03;
				TA531SysEnv.TA531_env_Relay3 = (buf_rec[4] >> 4) & 0x03;
				TA531SysEnv.TA531_env_Relay4 = (buf_rec[4] >> 6) & 0x03;
				TA531SysEnv.TA531_env_Relay5 = (buf_rec[5] >> 0) & 0x03;
				TA531SysEnv.TA531_env_Relay6 = (buf_rec[5] >> 2) & 0x03;

				//TA531 Ack
				TSA_Ack_DATA[3] = 1;
				TSA3_0x52_Flag = 1;
			} else if (FDCAN1_RxHeader.Identifier == 0x053)	//TSA_4
					{
				TA531SysEnv.TA531_env_WindowFL = (buf_rec[0] >> 0) & 0x0F;
				TA531SysEnv.TA531_env_WindowFR = (buf_rec[0] >> 4) & 0x0F;
				TA531SysEnv.TA531_env_WindowRL = (buf_rec[1] >> 0) & 0x0F;
				TA531SysEnv.TA531_env_WindowRR = (buf_rec[1] >> 4) & 0x0F;

				TA531SysEnv.TA531_env_DoorSwF = (buf_rec[4] >> 0) & 0x03;
				TA531SysEnv.TA531_env_DoorSwR = (buf_rec[4] >> 2) & 0x03;
				TA531SysEnv.TA531_env_HSD12_1 = (buf_rec[4] >> 4) & 0x01;
				TA531SysEnv.TA531_env_HSD12_2 = (buf_rec[4] >> 5) & 0x01;
				TA531SysEnv.TA531_env_HSD5_1 = (buf_rec[4] >> 6) & 0x01;
				TA531SysEnv.TA531_env_HSD5_2 = (buf_rec[4] >> 7) & 0x01;

				TA531SysEnv.TA531_env_DoorSwFL = (buf_rec[5] >> 0) & 0x03;
				TA531SysEnv.TA531_env_DoorSwFR = (buf_rec[5] >> 2) & 0x03;
				TA531SysEnv.TA531_env_DoorSwRL = (buf_rec[5] >> 4) & 0x03;
				TA531SysEnv.TA531_env_DoorSwRR = (buf_rec[5] >> 6) & 0x03;

				//TA531 Ack
				TSA_Ack_DATA[4] = 1;
				TSA4_0x53_Flag = 1;
			} else if (FDCAN1_RxHeader.Identifier == 0x103)	//TSA_LIN_SWS
					{
				TA531_LIN_SWS.LIN_SWS2_ErrRespSWS_1 = (buf_rec[0]>>0)&0x01;
				TA531_LIN_SWS.LIN_SWS2_RespErSWSF_1 = (buf_rec[0]>>1)&0x01;

				TA531_LIN_SWS.LIN_SWS_CCSwStsDistIncSwA_1 = (buf_rec[0]>>4)&0x01;
				TA531_LIN_SWS.LIN_SWS_CCSwStsCCASwA_1 = (buf_rec[0]>>5)&0x01;
				TA531_LIN_SWS.LIN_SWS_PfTrTapUpDwnSecySwSta_2 = (buf_rec[0]>>6)&0x03;

				TA531_LIN_SWS.LIN_SWS_CCSwStsSwDataIntgty_2 = (buf_rec[1]>>0)&0x03;
				TA531_LIN_SWS.LIN_SWS_CCSwStsSpdDecSwA_1 = (buf_rec[1]>>2)&0x01;
				TA531_LIN_SWS.LIN_SWS_CCSwStsSetSwA_1 = (buf_rec[1]>>3)&0x01;
				TA531_LIN_SWS.LIN_SWS_CCSwStsRsmSwA_1 = (buf_rec[1]>>4)&0x01;
				TA531_LIN_SWS.LIN_SWS_CCSwStsOnSwA_1 = (buf_rec[1]>>5)&0x01;
				TA531_LIN_SWS.LIN_SWS_CCSwStsDistDecSwA_1 = (buf_rec[1]>>6)&0x01;
				TA531_LIN_SWS.LIN_SWS_CCSwStsCanclSwA_1 = (buf_rec[1]>>7)&0x01;

				TA531_LIN_SWS.LIN_SWS_SWSFastrUserSwA_1 = (buf_rec[2]>>0)&0x01;
				TA531_LIN_SWS.LIN_SWS_SWSEntrtnUserSwA_1 = (buf_rec[2]>>1)&0x01;
				TA531_LIN_SWS.LIN_SWS_SWSCnfmSwA_1 = (buf_rec[2]>>2)&0x01;
				TA531_LIN_SWS.LIN_SWS_StrgWhlTipcSwDataIntgty_1 = (buf_rec[2]>>3)&0x01;
				TA531_LIN_SWS.LIN_SWS_StrgWhlEntrtnSwDtIntgty_1 = (buf_rec[2]>>4)&0x01;
				TA531_LIN_SWS.LIN_SWS_StrgWhlDrMdSwDtIntgty_1 = (buf_rec[2]>>5)&0x01;
				TA531_LIN_SWS.LIN_SWS_StrgWhlDrvngMdSwA_1 = (buf_rec[2]>>6)&0x01;
				TA531_LIN_SWS.LIN_SWS_CCSwStsSpdIncSwA_1 = (buf_rec[2]>>7)&0x01;

				TA531_LIN_SWS.LIN_SWS_SWSFnChngSwA_1 = (buf_rec[3]>>0)&0x01;
				TA531_LIN_SWS.LIN_SWS_SWSSelDwnSwA_1 = (buf_rec[3]>>1)&0x01;
				TA531_LIN_SWS.LIN_SWS_SWSSelLSwA_1 = (buf_rec[3]>>2)&0x01;
				TA531_LIN_SWS.LIN_SWS_SWSSelRSwA_1 = (buf_rec[3]>>3)&0x01;
				TA531_LIN_SWS.LIN_SWS_SWSSelUpSwA_1 = (buf_rec[3]>>4)&0x01;
				TA531_LIN_SWS.LIN_SWS_SWSSocContSwA_1 = (buf_rec[3]>>5)&0x01;
				TA531_LIN_SWS.LIN_SWS_SWSVcSwA_1 = (buf_rec[3]>>6)&0x01;
				TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve01_1 = (buf_rec[3]>>7)&0x01;

				TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve02_8 = (buf_rec[4]>>0)&0xff;

