YanqiS/stm32test/main - 副本.c
	    // SW_DOWN 检测
	    if (HAL_GPIO_ReadPin(GPIOB, SW_DOWN_Pin) == 0) {
	        SW_DW = 1;
	        if (SW_DW_pre == 1) {
	            SW_DW_cnt++;
	        } else {
	            SW_DW_cnt = 0;
	        }
	    } else {
	        SW_DW = 0;
	        SW_DW_cnt = 0;
	    }

	    // SW_LEFT 检测
	    if (HAL_GPIO_ReadPin(GPIOB, SW_LEFT_Pin) == 0) {
	        SW_LEFT = 1;
	        if (SW_LEFT_pre == 1) {
	            SW_LEFT_cnt++;
	        } else {
	            SW_LEFT_cnt = 0;
	        }
	    } else {
	        SW_LEFT = 0;
	        SW_LEFT_cnt = 0;
	    }

	    // SW_RIGHT 检测
	    if (HAL_GPIO_ReadPin(GPIOB, SW_RIGHT_Pin) == 0) {
	        SW_RIGHT = 1;
	        if (SW_RIGHT_pre == 1) {
	            SW_RIGHT_cnt++;
	        } else {
	            SW_RIGHT_cnt = 0;
	        }
	    } else {
	        SW_RIGHT = 0;
	        SW_RIGHT_cnt = 0;
	    }

	    // SW_BUTTON 检测（不需要计数）
	    if (HAL_GPIO_ReadPin(GPIOF, SW_BUTTON_Pin) == 0) {
	        SW_BUTTON = 1;
	    } else {
	        SW_BUTTON = 0;
	    }

		////Sys state
		sys_state++;
		sys_state = sys_state % 7;
		switch (sys_state) {
		case 0:		//none
			HAL_GPIO_WritePin(GPIOB, IO_SYS_LED_B_Pin, 0);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_G_Pin, 0);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_R_Pin, 0);
			break;
		case 1:		//green
			HAL_GPIO_WritePin(GPIOB, IO_SYS_LED_B_Pin, 0);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_G_Pin, 1);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_R_Pin, 0);
			break;
		case 2:		//cyan
			HAL_GPIO_WritePin(GPIOB, IO_SYS_LED_B_Pin, 1);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_G_Pin, 1);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_R_Pin, 0);
			break;
		case 3:		//blue
			HAL_GPIO_WritePin(GPIOB, IO_SYS_LED_B_Pin, 1);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_G_Pin, 0);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_R_Pin, 0);
			break;
		case 4:		//yellow
			HAL_GPIO_WritePin(GPIOB, IO_SYS_LED_B_Pin, 0);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_G_Pin, 1);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_R_Pin, 1);
			break;
		case 5:		//purple
			HAL_GPIO_WritePin(GPIOB, IO_SYS_LED_B_Pin, 1);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_G_Pin, 0);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_R_Pin, 1);
			break;
		case 6:		//red
			HAL_GPIO_WritePin(GPIOB, IO_SYS_LED_B_Pin, 0);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_G_Pin, 0);
			HAL_GPIO_WritePin(GPIOE, IO_SYS_LED_R_Pin, 1);
			break;
		}
	}
	if (htim == &htim14)	//1000ms
			{

		//TA531 Ack
		TSA_Ack_DATA[0] = 0x64;	//100
		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_Ack_Header, TSA_Ack_DATA);
		TSA_Ack_DATA[0] = 0;

		Sys_CNT++;

		uint32_t value_ADC1_0;
		value_ADC1_0 = mRead_ADC1_ch(1);
		if (value_ADC1_0 < 4500) {
			Bench_Info.Bench_PowerSts = 0;
		} else if (value_ADC1_0 < 9000) {
			Bench_Info.Bench_PowerSts = 1;
			Sys_RunCNT++;
		} else if (value_ADC1_0 < 13500) {
			Bench_Info.Bench_PowerSts = 2;
			Sys_RunCNT++;
		} else {
			Bench_Info.Bench_PowerSts = 3;
			Sys_RunCNT++;
		}

//		SPI_Flash_WriteSomeBytes(&Sys_CNT, Sys_CNT_Addr, sizeof(Sys_CNT));
//		SPI_Flash_WriteSomeBytes(&Sys_RunCNT, Sys_RunCNT_Addr, sizeof(Sys_RunCNT));

///////// XL9555
		uint8_t XL9555_tempdata;
		XL9555_tempdata = XL9555_Read(XL9555_1_addr_read, 0);
		TA531_GP_IN.GP_IN_1_1 = !((XL9555_tempdata >> 0) & 0x01);
		TA531_GP_IN.GP_IN_1_2 = !((XL9555_tempdata >> 1) & 0x01);
		TA531_GP_IN.GP_IN_1_3 = !((XL9555_tempdata >> 2) & 0x01);
		TA531_GP_IN.GP_IN_1_4 = !((XL9555_tempdata >> 3) & 0x01);
		TA531_GP_IN.GP_IN_1_5 = !((XL9555_tempdata >> 4) & 0x01);
		TA531_GP_IN.GP_IN_1_6 = !((XL9555_tempdata >> 5) & 0x01);
		TA531_GP_IN.GP_IN_1_7 = !((XL9555_tempdata >> 6) & 0x01);
		TA531_GP_IN.GP_IN_1_8 = !((XL9555_tempdata >> 7) & 0x01);

		XL9555_tempdata = XL9555_Read(XL9555_1_addr_read, 1);
		TA531_GP_IN.GP_IN_2_8 = !((XL9555_tempdata >> 0) & 0x01);
		TA531_GP_IN.GP_IN_2_7 = !((XL9555_tempdata >> 1) & 0x01);
		TA531_GP_IN.GP_IN_2_6 = !((XL9555_tempdata >> 2) & 0x01);
		TA531_GP_IN.GP_IN_2_5 = !((XL9555_tempdata >> 3) & 0x01);
		TA531_GP_IN.GP_IN_2_4 = !((XL9555_tempdata >> 4) & 0x01);
		TA531_GP_IN.GP_IN_2_3 = !((XL9555_tempdata >> 5) & 0x01);
		TA531_GP_IN.GP_IN_2_2 = !((XL9555_tempdata >> 6) & 0x01);
		TA531_GP_IN.GP_IN_2_1 = !((XL9555_tempdata >> 7) & 0x01);

		XL9555_tempdata = XL9555_Read(XL9555_2_addr_read, 0);
		TA531_GP_IN.GP_IN_3_1 = !((XL9555_tempdata >> 0) & 0x01);
		TA531_GP_IN.GP_IN_3_2 = !((XL9555_tempdata >> 1) & 0x01);
		TA531_GP_IN.GP_IN_3_3 = !((XL9555_tempdata >> 2) & 0x01);
		TA531_GP_IN.GP_IN_3_4 = !((XL9555_tempdata >> 3) & 0x01);
		TA531_GP_IN.GP_IN_3_5 = !((XL9555_tempdata >> 4) & 0x01);
		TA531_GP_IN.GP_IN_3_6 = !((XL9555_tempdata >> 5) & 0x01);
		TA531_GP_IN.GP_IN_3_7 = !((XL9555_tempdata >> 6) & 0x01);
		TA531_GP_IN.GP_IN_3_8 = !((XL9555_tempdata >> 7) & 0x01);

		XL9555_tempdata = XL9555_Read(XL9555_2_addr_read, 1);
		TA531_GP_IN.GP_IN_4_8 = !((XL9555_tempdata >> 0) & 0x01);
		TA531_GP_IN.GP_IN_4_7 = !((XL9555_tempdata >> 1) & 0x01);
		TA531_GP_IN.GP_IN_4_6 = !((XL9555_tempdata >> 2) & 0x01);
		TA531_GP_IN.GP_IN_4_5 = !((XL9555_tempdata >> 3) & 0x01);
		TA531_GP_IN.GP_IN_4_4 = !((XL9555_tempdata >> 4) & 0x01);
		TA531_GP_IN.GP_IN_4_3 = !((XL9555_tempdata >> 5) & 0x01);
		TA531_GP_IN.GP_IN_4_2 = !((XL9555_tempdata >> 6) & 0x01);
		TA531_GP_IN.GP_IN_4_1 = !((XL9555_tempdata >> 7) & 0x01);

		TSA_GP_IN_DATA[0] = ((TA531_GP_IN.GP_IN_1_1 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_1_2 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_1_3 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_1_4 & 0x03) << 6);
		TSA_GP_IN_DATA[1] = ((TA531_GP_IN.GP_IN_1_5 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_1_6 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_1_7 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_1_8 & 0x03) << 6);
		TSA_GP_IN_DATA[2] = ((TA531_GP_IN.GP_IN_2_1 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_2_2 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_2_3 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_2_4 & 0x03) << 6);
		TSA_GP_IN_DATA[3] = ((TA531_GP_IN.GP_IN_2_5 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_2_6 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_2_7 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_2_8 & 0x03) << 6);
		TSA_GP_IN_DATA[4] = ((TA531_GP_IN.GP_IN_3_1 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_3_2 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_3_3 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_3_4 & 0x03) << 6);
		TSA_GP_IN_DATA[5] = ((TA531_GP_IN.GP_IN_3_5 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_3_6 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_3_7 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_3_8 & 0x03) << 6);
		TSA_GP_IN_DATA[6] = ((TA531_GP_IN.GP_IN_4_1 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_4_2 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_4_3 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_4_4 & 0x03) << 6);
		TSA_GP_IN_DATA[7] = ((TA531_GP_IN.GP_IN_4_5 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_4_6 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_4_7 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_4_8 & 0x03) << 6);

		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_GP_IN_Header,
				TSA_GP_IN_DATA);

