YanqiS/stm32test/main - 副本.c
	}

	if (htim == &htim16)	//5ms
			{
		Sys_TIM_Flag = 1;	//for CAN

		Sys_TIM_TICK = Sys_TIM_TICK + 5;

		if (Sys_TIM_TICK > 0xFFFFFFF0) {
			Sys_TIM_TICK = 0;
		}
	}
	if (htim == &htim17)	//1ms
			{

	}

}

uint8_t Lin_CheckPID(uint8_t id) {
	uint8_t returnpid;
	uint8_t P0;
	uint8_t P1;

	P0 = (((id) ^ (id >> 1) ^ (id >> 2) ^ (id >> 4)) & 0x01) << 6;
	P1 = ((~((id >> 1) ^ (id >> 3) ^ (id >> 4) ^ (id >> 5))) & 0x01) << 7;

	returnpid = id | P0 | P1;

	return returnpid;
}

// 是经典校验还是增强校验，另：诊断帧只能经典校�?????????????????????????????????
uint8_t Lin_Checksum(uint8_t id, uint8_t *data) {
	uint8_t t;
	uint8_t sum;

	sum = data[0];
	if (id == 0x3c)			// 如果是诊断帧，用经典校验
			{
		for (t = 1; t < 8; t++) {
			sum += data[t];
			if (sum & 0xff00) {
				sum &= 0x00ff;
				sum += 1;
			}
		}
		sum = ~sum;
		data[8] = sum;
		//	return (uint8_t)sum ;
	}

	for (t = 1; t < 8; t++) {
		sum += data[t];
		if (sum & 0xff00) {
			sum &= 0x00ff;
			sum += 1;
		}
	}
	sum += Lin_CheckPID(id);
	if (sum & 0xff00) {
		sum &= 0x00ff;
		sum += 1;
	}
	sum = ~sum;
	data[8] = sum;
	return (uint8_t) sum;
}

void Lin_SendData(uint8_t *data) {
	Lin_Checksum(ReceiveID, data);

	HAL_UART_Transmit_IT(&huart1, data, 9);
}

void Lin_DataProcess_loop(void)	//asap, if need to deal with LIN data; if not ,seems no use
{
//// pack LIN data wait to send	//TBD
//SWS_0x00_Data
	SWS_0x00_Data[0] = 0;	//LIN_SWS_050ms_PDU000_CRC_8
	SWS_0x00_Data[5] = 0;	//LIN_SWS_CCSwStsPV_8
	SWS_0x00_Data[6] = 0;	//LIN_SWS_050ms_PDU00_Reserve02_8

	//SWS_0x00_Data[8] // checksum auto

	SWS_0x00_Data[1] = ((TA531_LIN_SWS.LIN_SWS_050ms_PDU00_RC_4 & 0x0f) << 0)
			+ ((TA531_LIN_SWS.LIN_SWS_CCSwStsDistIncSwA_1 & 0x01) << 4)
			+ ((TA531_LIN_SWS.LIN_SWS_CCSwStsCCASwA_1 & 0x01) << 5)
			+ ((TA531_LIN_SWS.LIN_SWS_PfTrTapUpDwnSecySwSta_2 & 0x03) << 6);

	SWS_0x00_Data[2] = ((TA531_LIN_SWS.LIN_SWS_CCSwStsSwDataIntgty_2 & 0x03)
			<< 0) + ((TA531_LIN_SWS.LIN_SWS_CCSwStsSpdDecSwA_1 & 0x01) << 2)
			+ ((TA531_LIN_SWS.LIN_SWS_CCSwStsSetSwA_1 & 0x01) << 3)
			+ ((TA531_LIN_SWS.LIN_SWS_CCSwStsRsmSwA_1 & 0x01) << 4)
			+ ((TA531_LIN_SWS.LIN_SWS_CCSwStsOnSwA_1 & 0x01) << 5)
			+ ((TA531_LIN_SWS.LIN_SWS_CCSwStsDistDecSwA_1 & 0x01) << 6)
			+ ((TA531_LIN_SWS.LIN_SWS_CCSwStsCanclSwA_1 & 0x01) << 7);

	SWS_0x00_Data[3] = ((TA531_LIN_SWS.LIN_SWS_SWSFastrUserSwA_1 & 0x01) << 0)
			+ ((TA531_LIN_SWS.LIN_SWS_SWSEntrtnUserSwA_1 & 0x01) << 1)
			+ ((TA531_LIN_SWS.LIN_SWS_SWSCnfmSwA_1 & 0x01) << 2)
			+ ((TA531_LIN_SWS.LIN_SWS_StrgWhlTipcSwDataIntgty_1 & 0x01) << 3)
			+ ((TA531_LIN_SWS.LIN_SWS_StrgWhlEntrtnSwDtIntgty_1 & 0x01) << 4)
			+ ((TA531_LIN_SWS.LIN_SWS_StrgWhlDrMdSwDtIntgty_1 & 0x01) << 5)
			+ ((TA531_LIN_SWS.LIN_SWS_StrgWhlDrvngMdSwA_1 & 0x01) << 6)
			+ ((TA531_LIN_SWS.LIN_SWS_CCSwStsSpdIncSwA_1 & 0x01) << 7);

	SWS_0x00_Data[4] = ((TA531_LIN_SWS.LIN_SWS_SWSFnChngSwA_1 & 0x01) << 0)
			+ ((TA531_LIN_SWS.LIN_SWS_SWSSelDwnSwA_1 & 0x01) << 1)
			+ ((TA531_LIN_SWS.LIN_SWS_SWSSelLSwA_1 & 0x01) << 2)
			+ ((TA531_LIN_SWS.LIN_SWS_SWSSelRSwA_1 & 0x01) << 3)
			+ ((TA531_LIN_SWS.LIN_SWS_SWSSelUpSwA_1 & 0x01) << 4)
			+ ((TA531_LIN_SWS.LIN_SWS_SWSSocContSwA_1 & 0x01) << 5)
			+ ((TA531_LIN_SWS.LIN_SWS_SWSVcSwA_1 & 0x01) << 6)
			+ ((TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve01_1 & 0x01) << 7);

	SWS_0x00_Data[7] = ((TA531_LIN_SWS.LIN_SWS_SWSLFnChngSwA_1 & 0x01) << 0)
			+ ((TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve03_7 & 0x7f) << 1);

//SWS_0x02_Data

////option Part 1: deal with received LIN data

	uint8_t PIDChecksum;
	uint8_t SumCheck;

	if (DataReceiveflag == 1) {
		ReceiveID = ReceivePID & 0x3f;
		PIDChecksum = Lin_CheckPID(ReceiveID);
		if (PIDChecksum != ReceivePID) {
			return;
		} else {
		}
		if (FrameReceiveOverFlag == 1)// 从机�?????????????????????????????????要执行信�?????????????????????????????????
				{
			SumCheck = Lin_Checksum(ReceiveID, LinReceiveData);
			if (ReceiveCheckSum != SumCheck) {
				return;
			} else {
			}

			if (ReceiveID == 0x23)		//receive data
					{
				if (LinReceiveData[3] == 0x01) {
				} else if (LinReceiveData[3] == 0x02) {
				} else {
				}
			}
		}
		FrameReceiveOverFlag = 0;
		DataReceiveflag = 0;
	}

}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart == &huart1)//((huart == &huart1)&(__HAL_UART_GET_FLAG(huart, UART_FLAG_RXNE) != RESET))  //
			{

		if (LIN_Data_LENGTH == 1) {
			ReceiveData = u1RxData[0];
		} else {
			for (int i = 0; i < LIN_Data_LENGTH; i++) {
				RxData[i] = u1RxData[i];
			}
			ReceiveData = u1RxData[0];
		}

		if (DataProcess == 0) {
			if (ReceiveData != 0x55) {
				LIN_RESET(&huart1);
				HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
				return;
			}
			if (ReceiveData == 0x55) {
				DataProcess = 1;

				LIN_RESET(&huart1);
				HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
				return;
			}
		} else if (DataProcess == 1) {
			ReceivePID = ReceiveData;
			ReceiveID = ReceivePID & 0x3f;

			if (ReceiveID == 0x00)//SWS_GW_LIN2_FrP00: 0x00, SWS			// 从机�????????????????要反馈信�????????????????,SWS_GW_LIN2_FrP00: 0x00
					//if(ReceiveID == 0x22)
					{
				TA531_LIN_SWS.LIN_SWS_050ms_PDU00_RC_4++;
				if (TA531_LIN_SWS.LIN_SWS_050ms_PDU00_RC_4 > 15) {
					TA531_LIN_SWS.LIN_SWS_050ms_PDU00_RC_4 = 0;
				}
				Lin_SendData(SWS_0x00_Data);//SWS_0x00_Flag, SWS_0x02_Flag, HOD_0x0_Flag, EBS_0x0_Flag, IFP_0x0_Flag;
				SWS_0x00_Flag = 0;
				DataProcess = 0;

				LIN_RESET(&huart1);
				HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
				return;
			} else if (ReceiveID == 0x02)// 从机�????????????????要反馈信�????????????????,SWS_GW_LIN2_FrP01: 0x02
					{
				Lin_SendData(SWS_0x02_Data);
				SWS_0x02_Flag = 0;
				DataProcess = 0;

				LIN_RESET(&huart1);
				HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
				return;
			} else {
				DataReceiveflag = 1;
				DataProcess = 2;

				LIN_RESET(&huart1);
				HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
				return;
			}
		} else if (DataProcess == 2) {
			if (DtRxProcess < 8) {
				LinReceiveData[DtRxProcess] = ReceiveData;
				DtRxProcess += 1;
				if (DtRxProcess == 8) {
					DtRxProcess = 0;
					DataProcess = 3;

					LIN_RESET(&huart1);
					HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
					return;
				}
			}
		} else if (DataProcess == 3) {
			ReceiveCheckSum = ReceiveData;
			FrameReceiveOverFlag = 1;
			DataProcess = 0;
		}

