YanqiS/stm32test/main - 副本.c
	}
	LIN_RESET(&huart1);
	HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);

//	LIN_RESET(&huart2);
//	HAL_UART_Receive_IT(&huart2,u2RxData, LIN_Data_LENGTH );
//
//	LIN_RESET(&huart3);
//	HAL_UART_Receive_IT(&huart3,u3RxData, LIN_Data_LENGTH );
}

void UART_Init(UART_HandleTypeDef *handle, uint32_t data_length) {

	if (handle == &huart1) {
		HAL_UART_Receive_IT(&huart1, u1RxData, Serial_Data_LENGTH);	//
	}

}

void UART_RESET(UART_HandleTypeDef *handle) {

	HAL_UART_AbortReceive(handle);
	HAL_UART_AbortReceive_IT(handle);
	/* Clear RXNE interrupt flag *//* Discard the received data */
	__HAL_UART_SEND_REQ(handle, UART_RXDATA_FLUSH_REQUEST);

}
//void CAN2Ser_Config(void)
//{
//
//}

uint32_t mRead_ADC1_ch(uint8_t ch) {
	//start ADC
	HAL_ADC_Start(&hadc1);

	HAL_ADC_PollForConversion(&hadc1, 500);

	if (ch == 1) {

	} else if (ch == 2)	//```6
			{

	}

//    if (HAL_IS_BIT_SET(HAL_ADC_GetState(&hadc1), HAL_ADC_STATE_REG_EOC))//读取ADC完成标志�????????????????????????????????????????
//    {
//        adc_value = HAL_ADC_GetValue(&hadc1);//读出ADC数�??
//
//        // 将ADC值转换为电压
//        mVoltage = adc_value  *1165 /165 * 3250/ 4095; // 12位ADC，最�????????????????????????????????????????4095
//    }

	// 停止ADC转换
	HAL_ADC_Stop(&hadc1);

	return mVoltage;
}

void MoC_Init() {
	////42 MotorCtrl init
	SPI_Stop(Flash_SPI);
	HAL_Delay(10);
	SPI_Flash_Start(Flash_SPI);
	HAL_Delay(10);


	uint8_t init_retry_cnt = 0;
	MotorInit_M1 = 0;
	MotorInit_M2 = 0;
	MotorInit_M3 = 0;
	MotorInit_M4 = 0;

	MotorCtrl_M1.MotorCtrl_HostID = HostID;
	MotorCtrl_M1.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M1.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M1.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M1.MotorCtrl_DataCode = 0x000000;

	MotorCtrl_M2.MotorCtrl_HostID = HostID;
	MotorCtrl_M2.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M2.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M2.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M2.MotorCtrl_DataCode = 0x000000;

	MotorInit_M1 = 1;	//init wait
	MotorInit_M2 = 1;	//init wait
	MotoCtrl_PackSend12();
	HAL_Delay(500);

	while ((MotorInit_M1 != 2) | (MotorInit_M2 != 2)) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M1&2 Init Wait ");
		HAL_Delay(1000);
	    // 只有在超时的情况下才重发（比如5秒后）
	    init_retry_cnt++;
	    if (init_retry_cnt >= 5) {  // 5秒后重发
	        MotoCtrl_PackSend12();
	        init_retry_cnt = 0;
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Retry Init...  ");
	    }

	    // 添加超时保护（30秒）
	    if (init_retry_cnt >= 30) {
	        OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Init Timeout!  ");
	        Sys_tune2();
	        HAL_Delay(2000);
	        // 可以选择重启或继续
	        // HAL_NVIC_SystemReset();
	        break;
	}
	}

	char str1[16] = { 0 };

	OLED_ShowString(OLED_I2C_ch, OLED_type, 9, 0, "1 2");	// 9 11 13 15
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M1&2 Init ok! ");

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X: ");
	itoa(M1_ID, str1, 16);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 2, str1);
	itoa(TA531_RC1.TA531_RC_X_act, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, str1);

	MotorCtrl_M3.MotorCtrl_HostID = HostID;
	MotorCtrl_M3.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M3.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M3.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M3.MotorCtrl_DataCode = 0x000000;

	MotorInit_M3 = 1;	//init wait
	MotoCtrl_PackSend3();
	HAL_Delay(500);

	while (MotorInit_M3 != 2) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M3 Init Wait ");
		HAL_Delay(500);
		MotoCtrl_PackSend3();
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 13, 0, "3 ");	// 9 11 13 15
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M3 Initialized! ");

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Y: ");
	itoa(M3_ID, str1, 16);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 3, str1);
	itoa(TA531_RC1.TA531_RC_Y_act, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 3, str1);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Check TouchPen! ");
	HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 1);	//F
	HAL_Delay(700);
	HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 0);	//F
	HAL_Delay(1000);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "PuhUp Rst DispXY");
	HAL_Delay(2000);

	if (SW_UP == 1)	////reset display xy
			{
		Sys_tune1();
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold Up 2s Reset");
		HAL_Delay(800);
		if (SW_UP == 1)	////reset display xy
				{
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold Up 1s Reset");
			HAL_Delay(800);
			Sys_tune2();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Release & Reset");
			HAL_Delay(2000);

			if (SW_UP == 0)	// into reset display xy
					{
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
						"U/D/L/R Set X0Y0");
				HAL_Delay(800);
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X0:");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, "Y0:");

				while (SW_BUTTON == 0) {
				    // UP键 - 渐进加速
				    if (SW_UP == 1) {
				        int step;
				        if (SW_UP_cnt == 0) {
				            step = 1;   // 首次：1
				        } else if (SW_UP_cnt < 8) {
				            step = 5;  // 0.3秒内：5
				        } else if (SW_UP_cnt < 15) {
				            step = 10;  // 0.8秒内：10
				        } else {
				            step = 30;  // 超过0.8秒：30（快速移动）
				        }
				        TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act + step;
				        TA531_RC1_fg = 2;
				    }

				    // DOWN键 - 渐进加速
				    else if (SW_DW == 1) {
				        int step;
				        if (SW_DW_cnt == 0) {
				            step = 1;
				        } else if (SW_DW_cnt < 8) {
				            step = 5;
				        } else if (SW_DW_cnt < 15) {
				            step = 10;
				        } else {
				            step = 30;
				        }
				        TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act - step;
				        if (TA531_RC1.TA531_RC_X_trg < 0) {
				            TA531_RC1.TA531_RC_X_trg = 0;
				        }
				        TA531_RC1_fg = 2;
				    }

