YanqiS/stm32test/main - 副本.c
				    MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);
				    HAL_Delay(50);

				    itoa(TA531_RC1.TA531_RC_X_trg, str1, 10);
				    OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 2, str1);
				    itoa(TA531_RC1.TA531_RC_Y_trg, str1, 10);
				    OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 2, str1);
				}

				////push down
				ScreenSz_1.DispX1_32b = TA531_RC1.TA531_RC_X_trg;
				ScreenSz_1.DispX1[0] = TA531_RC1.TA531_RC_X_trg & 0xff;
				ScreenSz_1.DispX1[1] = (TA531_RC1.TA531_RC_X_trg >> 8) & 0xff;
				ScreenSz_1.DispX1[2] = (TA531_RC1.TA531_RC_X_trg >> 16) & 0xff;
				ScreenSz_1.DispX1[3] = (TA531_RC1.TA531_RC_X_trg >> 24) & 0xff;

				ScreenSz_1.DispY1_32b = TA531_RC1.TA531_RC_Y_trg;
				ScreenSz_1.DispY1[0] = TA531_RC1.TA531_RC_Y_trg & 0xff;
				ScreenSz_1.DispY1[1] = (TA531_RC1.TA531_RC_Y_trg >> 8) & 0xff;
				ScreenSz_1.DispY1[2] = (TA531_RC1.TA531_RC_Y_trg >> 16) & 0xff;
				ScreenSz_1.DispY1[3] = (TA531_RC1.TA531_RC_Y_trg >> 24) & 0xff;

				SPI_Flash_Start(Flash_SPI);
				HAL_Delay(1);
				SPI_Flash_WtritEnable();
				HAL_Delay(5);
				SPI_Flash_WriteSomeBytes(ScreenSz_1.DispX1, Sys_Addr_DispX1,
						sizeof(int));
				HAL_Delay(1);
				SPI_Flash_WtritEnable();
				HAL_Delay(5);
				SPI_Flash_WriteSomeBytes(ScreenSz_1.DispY1, Sys_Addr_DispY1,
						sizeof(int));
				HAL_Delay(1);

				SPI_Flash_ReadBytes(temp1, Sys_Addr_DispX1, sizeof(int));
				if ((temp1[0] != ScreenSz_1.DispX1[0])
						| (temp1[1] != ScreenSz_1.DispX1[1])
						| (temp1[2] != ScreenSz_1.DispX1[2])
						| (temp1[3] != ScreenSz_1.DispX1[3])) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash Err!");
					while ((temp1[0] != ScreenSz_1.DispX1[0])
							| (temp1[1] != ScreenSz_1.DispX1[1])
							| (temp1[2] != ScreenSz_1.DispX1[2])
							| (temp1[3] != ScreenSz_1.DispX1[3])) {
						SPI_Flash_WriteSomeBytes(ScreenSz_1.DispX1,
								Sys_Addr_DispX1, sizeof(int));
						HAL_Delay(1);
						SPI_Flash_ReadBytes(temp1, Sys_Addr_DispX1,
								sizeof(int));
					}
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash OK!");
				}

				SPI_Flash_ReadBytes(temp1, Sys_Addr_DispY1, sizeof(int));
				if ((temp1[0] != ScreenSz_1.DispY1[0])
						| (temp1[1] != ScreenSz_1.DispY1[1])
						| (temp1[2] != ScreenSz_1.DispY1[2])
						| (temp1[3] != ScreenSz_1.DispY1[3])) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash Err!");
					while ((temp1[0] != ScreenSz_1.DispY1[0])
							| (temp1[1] != ScreenSz_1.DispY1[1])
							| (temp1[2] != ScreenSz_1.DispY1[2])
							| (temp1[3] != ScreenSz_1.DispY1[3])) {
						SPI_Flash_WriteSomeBytes(ScreenSz_1.DispY1,
								Sys_Addr_DispY1, sizeof(int));
						HAL_Delay(1);
						SPI_Flash_ReadBytes(temp1, Sys_Addr_DispY1,
								sizeof(int));
					}
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash OK!");
				}

				////push down

				////Display Area reset finish		//DispX0,DispX1,DispY0,DispY1;

				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
						"Reset XY finish!");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2,
						"                ");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3,
						"                ");

			}	//finish reset display xy
		}	//reset display xy comfirm
	}	//reset display xy comfirm
	else {	//DispX0,DispX1,DispY0,DispY1;
		SPI_Flash_ReadBytes(ScreenSz_1.DispX0, Sys_Addr_DispX0, sizeof(int));
		SPI_Flash_ReadBytes(ScreenSz_1.DispY0, Sys_Addr_DispY0, sizeof(int));
		SPI_Flash_ReadBytes(ScreenSz_1.DispX1, Sys_Addr_DispX1, sizeof(int));
		SPI_Flash_ReadBytes(ScreenSz_1.DispY1, Sys_Addr_DispY1, sizeof(int));

		ScreenSz_1.DispX0_32b = ScreenSz_1.DispX0[0]
				+ (ScreenSz_1.DispX0[1] << 8) + (ScreenSz_1.DispX0[2] << 16)
				+ (ScreenSz_1.DispX0[3] << 24);
		ScreenSz_1.DispX1_32b = ScreenSz_1.DispX1[0]
				+ (ScreenSz_1.DispX1[1] << 8) + (ScreenSz_1.DispX1[2] << 16)
				+ (ScreenSz_1.DispX1[3] << 24);
		ScreenSz_1.DispY0_32b = ScreenSz_1.DispY0[0]
				+ (ScreenSz_1.DispY0[1] << 8) + (ScreenSz_1.DispY0[2] << 16)
				+ (ScreenSz_1.DispY0[3] << 24);
		ScreenSz_1.DispY1_32b = ScreenSz_1.DispY1[0]
				+ (ScreenSz_1.DispY1[1] << 8) + (ScreenSz_1.DispY1[2] << 16)
				+ (ScreenSz_1.DispY1[3] << 24);

		HAL_Delay(10);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Read XY fm Flash");
		HAL_Delay(200);


	    char str1[16] = {0};
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X0:");
	    itoa(ScreenSz_1.DispX0_32b, str1, 10);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 2, str1);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, "X1:");
	    itoa(ScreenSz_1.DispX1_32b, str1, 10);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 2, str1);

	    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Y0:");
	    itoa(ScreenSz_1.DispY0_32b, str1, 10);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 3, str1);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 3, "Y1:");
	    itoa(ScreenSz_1.DispY1_32b, str1, 10);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 3, str1);
	    HAL_Delay(2000);


		if ((ScreenSz_1.DispX0_32b > 0)
				& (ScreenSz_1.DispX0_32b < ScreenSz_1.DispX1_32b)
				& (ScreenSz_1.DispX1_32b < XmaxLimit)
				& (ScreenSz_1.DispY0_32b > 0)
				& (ScreenSz_1.DispY0_32b < ScreenSz_1.DispY1_32b)
				& (ScreenSz_1.DispY1_32b < YmaxLimit)) {
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "XY Check Pass!");
		} else {
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "XY Check Fail!");
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "Pls Reboot &");
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Reset XY Area");
			Sys_tune2();

			while (1)
				;
		}
	}	//////finish reset display xy

	//////finish reset display xy

	// ========== 测试移动到 X0Y0 ==========
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Test Move to X0Y0");

	TA531_RC1.TA531_RC_X_trg = ScreenSz_1.DispX0_32b;
	TA531_RC1.TA531_RC_Y_trg = ScreenSz_1.DispY0_32b;
	TA531_RC1_fg = 2;

	// 循环等待到位
	while ((TA531_RC1.TA531_RC_X_act != TA531_RC1.TA531_RC_X_trg) ||
	       (TA531_RC1.TA531_RC_Y_act != TA531_RC1.TA531_RC_Y_trg)) {
	    MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);

	    // 显示目标和当前位置
	    char str_temp[24];
	    sprintf(str_temp, "Trg:(%d,%d)", TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str_temp);
	    sprintf(str_temp, "Act:(%d,%d)", TA531_RC1.TA531_RC_X_act, TA531_RC1.TA531_RC_Y_act);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, str_temp);

	    HAL_Delay(100);  // 小延迟
	}

