YanqiS/stm32test/main - 副本.c
	// 到位后再push
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "At X0Y0, Pushing...");
	HAL_Delay(200);
	HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 1);  // push
	HAL_Delay(500);
	HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 0);  // release
	HAL_Delay(200);

	// ========== 测试移动到 X1Y1 ==========
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Test Move to X1Y1");

	TA531_RC1.TA531_RC_X_trg = ScreenSz_1.DispX1_32b;
	TA531_RC1.TA531_RC_Y_trg = ScreenSz_1.DispY1_32b;
	TA531_RC1_fg = 2;

	// 循环等待到位
	while ((TA531_RC1.TA531_RC_X_act != TA531_RC1.TA531_RC_X_trg) ||
	       (TA531_RC1.TA531_RC_Y_act != TA531_RC1.TA531_RC_Y_trg)) {
	    MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);

	    char str_temp[24];
	    sprintf(str_temp, "Trg:(%d,%d)", TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str_temp);
	    sprintf(str_temp, "Act:(%d,%d)", TA531_RC1.TA531_RC_X_act, TA531_RC1.TA531_RC_Y_act);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, str_temp);

	    HAL_Delay(100);
	}

	// 到位后再push
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "At X1Y1, Pushing...");
	HAL_Delay(200);
	HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 1);  // push
	HAL_Delay(500);
	HAL_GPIO_WritePin(GPIOF, KL15_RELAY_Pin, 0);  // release
	HAL_Delay(200);

	// ========== 回到原点 (0,0) ==========
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Return to Origin");

	TA531_RC1_fg = 2;
	TA531_RC1.TA531_RC_X_trg = 0;
	TA531_RC1.TA531_RC_Y_trg = 0;

	// 循环等待到位
	while ((TA531_RC1.TA531_RC_X_act != 0) || (TA531_RC1.TA531_RC_Y_act != 0)) {
	    MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);

	    char str_temp[24];
	    sprintf(str_temp, "Act:(%d,%d)", TA531_RC1.TA531_RC_X_act, TA531_RC1.TA531_RC_Y_act);
	    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str_temp);

	    HAL_Delay(100);
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Test Complete!  ");
	HAL_Delay(2000);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Act: (");
	OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 3, ", ");
	OLED_ShowString(OLED_I2C_ch, OLED_type, 15, 3, ")");
}

void Clamp_Position(int *x, int *y, bool allow_reset)
{
    // 如果是复位命令，允许归0
    if (allow_reset && (*x == 0 && *y == 0))
    {
        return;
    }

    // 确保范围有效（X0 < X1, Y0 < Y1）
    int x_min = (ScreenSz_1.DispX0_32b < ScreenSz_1.DispX1_32b) ? ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
    int x_max = (ScreenSz_1.DispX0_32b > ScreenSz_1.DispX1_32b) ? ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
    int y_min = (ScreenSz_1.DispY0_32b < ScreenSz_1.DispY1_32b) ? ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;
    int y_max = (ScreenSz_1.DispY0_32b > ScreenSz_1.DispY1_32b) ? ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;

    // 限制X坐标
    if (*x < x_min) *x = x_min;
    if (*x > x_max) *x = x_max;

    // 限制Y坐标
    if (*y < y_min) *y = y_min;
    if (*y > y_max) *y = y_max;
}

void MotoCtrl_PackSend12() {
	MotrCtrl_1_DATA[0] = (MotorCtrl_M1.MotorCtrl_HostID >> 3) & 0xff;
	MotrCtrl_1_DATA[1] = (MotorCtrl_M1.MotorCtrl_HostID & 0x07) << 5;
	MotrCtrl_1_DATA[2] = ((MotorCtrl_M1.MotorCtrl_FuncType & 0x07) << 5)
			+ (MotorCtrl_M1.MotorCtrl_FuncCode & 0x1f);
	MotrCtrl_1_DATA[3] = MotorCtrl_M1.MotorCtrl_DataCode & 0xff;
	MotrCtrl_1_DATA[4] = (MotorCtrl_M1.MotorCtrl_DataCode >> 8) & 0xff;
	MotrCtrl_1_DATA[5] = (MotorCtrl_M1.MotorCtrl_DataCode >> 16) & 0xff;
	MotrCtrl_1_DATA[6] = (MotorCtrl_M1.MotorCtrl_DataCode >> 24) & 0xff;
	MotrCtrl_1_DATA[7] = MotorCtrl_M1.MotorCtrl_ByteData;

	MotrCtrl_2_DATA[0] = (MotorCtrl_M2.MotorCtrl_HostID >> 3) & 0xff;
	MotrCtrl_2_DATA[1] = (MotorCtrl_M2.MotorCtrl_HostID & 0x07) << 5;
	MotrCtrl_2_DATA[2] = ((MotorCtrl_M2.MotorCtrl_FuncType & 0x07) << 5)
			+ (MotorCtrl_M2.MotorCtrl_FuncCode & 0x1f);
	MotrCtrl_2_DATA[3] = MotorCtrl_M2.MotorCtrl_DataCode & 0xff;
	MotrCtrl_2_DATA[4] = (MotorCtrl_M2.MotorCtrl_DataCode >> 8) & 0xff;
	MotrCtrl_2_DATA[5] = (MotorCtrl_M2.MotorCtrl_DataCode >> 16) & 0xff;
	MotrCtrl_2_DATA[6] = (MotorCtrl_M2.MotorCtrl_DataCode >> 24) & 0xff;
	MotrCtrl_2_DATA[7] = MotorCtrl_M2.MotorCtrl_ByteData;

	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &MotrCtrl_2_TxHeader,
			MotrCtrl_2_DATA);
	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &MotrCtrl_1_TxHeader,
			MotrCtrl_1_DATA);
	HAL_Delay(20);
}

//void MotoCtrl_PackSend2()
//{
//    MotrCtrl_2_DATA[0] = (MotorCtrl_M2.MotorCtrl_HostID >>3) & 0xff ;
//    MotrCtrl_2_DATA[1] = (MotorCtrl_M2.MotorCtrl_HostID & 0x07) << 5 ;
//    MotrCtrl_2_DATA[2] = ((MotorCtrl_M2.MotorCtrl_FuncType & 0x07)<< 5) + (MotorCtrl_M2.MotorCtrl_FuncCode & 0x1f) ;
//    MotrCtrl_2_DATA[3] = MotorCtrl_M2.MotorCtrl_DataCode & 0xff ;
//    MotrCtrl_2_DATA[4] = (MotorCtrl_M2.MotorCtrl_DataCode >>8) & 0xff ;
//    MotrCtrl_2_DATA[5] = (MotorCtrl_M2.MotorCtrl_DataCode >>16) & 0xff ;
//    MotrCtrl_2_DATA[6] = (MotorCtrl_M2.MotorCtrl_DataCode >>24) & 0xff ;
//    MotrCtrl_2_DATA[7] = MotorCtrl_M2.MotorCtrl_ByteData;
//
//    HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &MotrCtrl_2_TxHeader, MotrCtrl_2_DATA);
//}

void MotoCtrl_PackSend3() {
	MotrCtrl_3_DATA[0] = (MotorCtrl_M3.MotorCtrl_HostID >> 3) & 0xff;
	MotrCtrl_3_DATA[1] = (MotorCtrl_M3.MotorCtrl_HostID & 0x07) << 5;
	MotrCtrl_3_DATA[2] = ((MotorCtrl_M3.MotorCtrl_FuncType & 0x07) << 5)
			+ (MotorCtrl_M3.MotorCtrl_FuncCode & 0x1f);
	MotrCtrl_3_DATA[3] = MotorCtrl_M3.MotorCtrl_DataCode & 0xff;
	MotrCtrl_3_DATA[4] = (MotorCtrl_M3.MotorCtrl_DataCode >> 8) & 0xff;
	MotrCtrl_3_DATA[5] = (MotorCtrl_M3.MotorCtrl_DataCode >> 16) & 0xff;
	MotrCtrl_3_DATA[6] = (MotorCtrl_M3.MotorCtrl_DataCode >> 24) & 0xff;
	MotrCtrl_3_DATA[7] = MotorCtrl_M3.MotorCtrl_ByteData;

	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &MotrCtrl_3_TxHeader,
			MotrCtrl_3_DATA);
	HAL_Delay(20);
}

void MotoCtrl_PackSend4() {

}

void MotoCtrl_PositionLoop(int PositionX_mm, int PositionY_mm) {
	if (PositionX_mm < 0)	//10mm -10 = 0
			{
		PositionX_mm = 0;
	} else if (PositionX_mm > XmaxLimit)	//190mm - 10mm = 180
	{
		PositionX_mm = XmaxLimit;
	}

	if (PositionY_mm < 0)	//10mm
			{
		PositionY_mm = 0;
	} else if (PositionY_mm > YmaxLimit)	//190mm + 10mm
	{
		PositionY_mm = YmaxLimit;
	}

