YanqiS/stm32test/main - 副本.c
}

void Sys_tune1() {
	htim1.Instance = TIM1;
//	  htim1.Init.Prescaler = 63;
//	  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim1.Init.Period = 1000;
//	  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
//	  htim1.Init.RepetitionCounter = 0;
//	  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
	if (HAL_TIM_PWM_Init(&htim1) != HAL_OK) {
		Error_Handler();
	}

	TIM_OC_InitTypeDef sConfigOC = { 0 };

	sConfigOC.OCMode = TIM_OCMODE_PWM1;
	sConfigOC.Pulse = 200;
//	  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
//	  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
//	  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
//	  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
//	  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
	if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1)
			!= HAL_OK) {
		Error_Handler();
	}
	sConfigOC.Pulse = 0;

	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	HAL_Delay(200);
	HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);
}

void Sys_tune2() {
	htim15.Instance = TIM15;  // ← 改这里
	htim15.Init.Period = 1500;
	if (HAL_TIM_PWM_Init(&htim15) != HAL_OK)  // ← 改这里
			{
		Error_Handler();
	}

	TIM_OC_InitTypeDef sConfigOC = { 0 };
	sConfigOC.OCMode = TIM_OCMODE_PWM1;
	sConfigOC.Pulse = 300;
	if (HAL_TIM_PWM_ConfigChannel(&htim15, &sConfigOC, TIM_CHANNEL_1) != HAL_OK) // ← 改这里
			{
		Error_Handler();
	}
	sConfigOC.Pulse = 0;

	HAL_TIM_PWM_Start(&htim15, TIM_CHANNEL_1);   // ← 改这里
	HAL_Delay(200);
	HAL_TIM_PWM_Stop(&htim15, TIM_CHANNEL_1);    // ← 改这里
}

/* ========== 新增：电机保护函数实现（从这里开始）========== */

/**
 * @brief  初始化电机保护系统
 * @param  None
 * @retval None
 */
void Motor_Protection_Init(void) {
    Motor_Protection.last_X_pos = 0;
    Motor_Protection.last_Y_pos = 0;
    Motor_Protection.X_direction_changes = 0;
    Motor_Protection.Y_direction_changes = 0;
    Motor_Protection.stuck_counter = 0;
    Motor_Protection.movement_timeout = 0;
    Motor_Protection.protection_triggered = 0;
    Motor_Protection.error_type = 0;
    Motor_Protection.total_errors = 0;
}

/**
 * @brief  重置保护计数器（在正常到达目标位置后调用）
 * @param  None
 * @retval None
 */
void Motor_Protection_Reset(void) {
    Motor_Protection.X_direction_changes = 0;
    Motor_Protection.Y_direction_changes = 0;
    Motor_Protection.stuck_counter = 0;
    Motor_Protection.movement_timeout = 0;
    Motor_Protection.protection_triggered = 0;
    Motor_Protection.error_type = 0;
}

/**
 * @brief  电机异常检测函数
 * @param  current_X: 当前X坐标
 * @param  current_Y: 当前Y坐标
 * @param  target_X: 目标X坐标
 * @param  target_Y: 目标Y坐标
 * @retval 0=正常, 1=检测到异常需要停止
 */
uint8_t Motor_Protection_Check(int16_t current_X, int16_t current_Y,
                                int16_t target_X, int16_t target_Y) {

    if (MOTOR_PROTECTION_ENABLED == 0) {
        return 0;  // 保护功能关闭
    }

    // 已经触发保护，直接返回
    if (Motor_Protection.protection_triggered > 0) {
        return 1;
    }

    // 计算位置变化
    int16_t delta_X = current_X - Motor_Protection.last_X_pos;
    int16_t delta_Y = current_Y - Motor_Protection.last_Y_pos;


    /* ====== 跳过无效采样 ====== */
    // 如果位置完全没变化，可能是还没更新，跳过本次检查
    if (delta_X == 0 && delta_Y == 0) {
        Motor_Protection.movement_timeout++;  // 但超时计时继续

        // 超时检测
        if (Motor_Protection.movement_timeout >= MAX_MOVEMENT_TIMEOUT) {
            Motor_Protection.protection_triggered = 1;
            Motor_Protection.error_type = 3;
            Motor_Protection.total_errors++;
            return 1;
        }

        return 0;  // 跳过本次停滞检测
    }
    /* =============================== */

    // 计算目标方向
    int16_t target_delta_X = target_X - current_X;
    int16_t target_delta_Y = target_Y - current_Y;

    // ==== 检测1: 方向反复变化（抽搐） ====
    // X轴方向检测
    if (delta_X != 0 && target_delta_X != 0) {
        // 如果实际移动方向与目标方向相反
        if ((delta_X > 0 && target_delta_X < 0) ||
            (delta_X < 0 && target_delta_X > 0)) {
            Motor_Protection.X_direction_changes++;

            if (Motor_Protection.X_direction_changes >= MAX_DIRECTION_CHANGES) {
                Motor_Protection.protection_triggered = 1;
                Motor_Protection.error_type = 1;  // 方向抖动错误
                Motor_Protection.total_errors++;
                return 1;
            }
        }
    }

    // Y轴方向检测
    if (delta_Y != 0 && target_delta_Y != 0) {
        if ((delta_Y > 0 && target_delta_Y < 0) ||
            (delta_Y < 0 && target_delta_Y > 0)) {
            Motor_Protection.Y_direction_changes++;

            if (Motor_Protection.Y_direction_changes >= MAX_DIRECTION_CHANGES) {
                Motor_Protection.protection_triggered = 1;
                Motor_Protection.error_type = 1;
                Motor_Protection.total_errors++;
                return 1;
            }
        }
    }

    // ==== 检测2: 位置停滞（卡住） ====
    // 如果位置几乎没有变化
    if (abs(delta_X) <= POSITION_TOLERANCE &&
        abs(delta_Y) <= POSITION_TOLERANCE) {
        Motor_Protection.stuck_counter++;

        if (Motor_Protection.stuck_counter >= MAX_STUCK_COUNT) {
            Motor_Protection.protection_triggered = 1;
            Motor_Protection.error_type = 2;  // 位置停滞错误
            Motor_Protection.total_errors++;
            return 1;
        }
    } else {
        // 有明显移动，重置停滞计数
        Motor_Protection.stuck_counter = 0;
    }

    // ==== 检测3: 运动超时 ====
    Motor_Protection.movement_timeout++;
    if (Motor_Protection.movement_timeout >= MAX_MOVEMENT_TIMEOUT) {
        Motor_Protection.protection_triggered = 1;
        Motor_Protection.error_type = 3;  // 运动超时错误
        Motor_Protection.total_errors++;
        return 1;
    }

    // 更新上次位置
    Motor_Protection.last_X_pos = current_X;
    Motor_Protection.last_Y_pos = current_Y;

    return 0;  // 正常
}

/**
 * @brief  电机紧急停止与重启
 * @param  None
 * @retval None
 */
void Motor_Protection_EmergencyStop(void) {
    // 标记为已停止
    Motor_Protection.protection_triggered = 2;

    // 紧急停止所有电机
    TA531_RC1_fg = 0;  // 停止任务状态机

    // 显示错误信息
    char error_msg[20];
    switch(Motor_Protection.error_type) {
        case 1:
            sprintf(error_msg, "ERR:Motor Shake!");
            break;
        case 2:
            sprintf(error_msg, "ERR:Motor Stuck!");
            break;
        case 3:
            sprintf(error_msg, "ERR:Timeout!    ");
            break;
        default:
            sprintf(error_msg, "ERR:Unknown!    ");
            break;
    }

