YanqiS/stm32test/main - 副本.c
    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, error_msg);
    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Stopping Motor..");

    // 发出警告音
    Sys_tune2();
    HAL_Delay(300);
    Sys_tune2();

    // 尝试安全复位到原点
    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Resetting...    ");
    MotoCtrl_PositionLoop(0, 0);
    HAL_Delay(2000);

    // 清空任务
    TA531_RC1.TA531_RC_X_trg = 0;
    TA531_RC1.TA531_RC_Y_trg = 0;
    TA531_RC1.TA531_RC_Reset = 0;
    TA531_RC1.TA531_RC_Z_code = 0;
    TA531_RC1.TA531_RC_X_Mov = 0;
    TA531_RC1.TA531_RC_Y_Mov = 0;
    TA531_Lock = 0;

    // 显示恢复信息
    OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "System Ready    ");
    Sys_tune1();

    // 重置保护系统，准备下次监控
    Motor_Protection_Reset();

    // 延迟一段时间后才允许重新启动
    HAL_Delay(1000);
}

/* ========== 电机保护函数实现结束 ========== */

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */

	char *str1 = "SYS ERROR!";
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str1);

	__disable_irq();
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
